{"filename": "Bart-Simpson", "question": "What is the name of the dog of the Simpsons", "start_in_document": 10876, "answer_text": "Santa's Little Helper", "start_in_context": 852, "answer_correct": true, "feedback_type": "qa", "context": "is when he was framed for a prank at a medieval festival held at school and was expelled\nfor it (the actual culprit was Groundskeeper Willie) but he was welcomed back as an apology[24], and a\nnotable example of the latter was when both he and Milhouse ended up permanently (at the time)\nbanned by Comic Book Guy from the Androids Dungeon because Bart and Milhouse talked Mrs. Prince\nout of selling him rare and invaluable Star Wars memorabilia that belonged to Martin Prince for what was\nobviously a ripped off price.[25]\nAlthough Lisa is a vegetarian, Bart is the real animal lover in the family. He becomes extremely attached\nto animals that fall under his care and will, most of the time, save animals that he feels will be hurt or\nelse will go to great lengths to protect them. Some of Bart's favorite pets include: his dog (and best\nfriend) named Santa's Little Helper, a snake named Strangles, an elephant named Stampy, a racehorse\nnamed Duncan, a nest of bird-eating lizards named Chirpy Boy and Bart Junior, Santa's Little Helper's\ngreyhound puppies and a cow named Lou, for whom he was willing to prematurely marry in order to\nspare from the slaughterhouse.\nCriminal record\nIndecent exposure: In The Simpsons Movie, Bart is dared by Homer to skateboard from home to\nKrusty Burger completely naked. Chief Wiggum notices this and chains Bart to a lamppost by the\nrestaurant.\nHarassment over Telephone: Bart makes prank calls to Moe at his tavern as a running gag.\nAssault with a Deadly Weapon: Throughout the subplot of \"Please Homer, Don't Hammer 'Em\",\nBart tries to trigger Skinner's allergies.\nArson: Bart once accidentally burned down his Christmas tree when opening gifts early, and then\nlied about it. In addition, while he was not actually responsible for this instance, he unknowingly\ntakes the heat for the charge of arson in order to allow Nelson Muntz, the actual culprit, to win"}
{"filename": "Marge-Simpson", "question": "Who are the children of the Simpsons", "start_in_document": 276, "answer_text": "Bart, Lisa, and\nMaggie", "start_in_context": 276, "answer_correct": true, "feedback_type": "qa", "context": "Marjorie Jacqueline \"Marge\"\nSimpson\nMarge Simpson\nMarjorie Jacqueline \"Marge\" Simpson (née\nBouvier)[11] is the homemaker and matriarch of the\nSimpson family. She is also one of the five main\ncharacters in The Simpsons TV series. She and her\nhusband Homer have three children: Bart, Lisa, and\nMaggie. Marge is the moralistic force in her family and\noften provides a grounding voice in the midst of her\nfamily's antics by trying to maintain order in the Simpson\nhousehold. Aside from her duties at home, Marge has\nflirted briefly with a number of careers ranging from a\npolice officer to an anti-violence activist.\nBiography\nEarly life\nMarge Bouvier was born on in Capital City to Clancy\nBouvier, a photographer-turned-steward, and Jacqueline\nBouvier. She is the youngest daughter of the Bouvier\nfamily. She has a pair of older sisters, the joyless twins,\nPatty and Selma, both of whom passionately disapprove\nof Homer.\nTitles and Styles\nH.S.H/Her Serene Highness, the Princess Consort of Springfield, Duchess of Bouvier and Countess of\nSimpson.\nMeeting Homer\nMarge attended Springfield High School and in her senior year, she met Homer Simpson. She was wary\nof Homer at first but agreed to have a study date with him, only to find out that Homer was only doing\nthis to get her to go to prom with him. She ended up going with Artie Ziff. She regrets going with Artie\nbecause he tried to have sex with her afterward. Artie takes her home and she later picks up Homer,\nwho she finds walking home, in her car. Marge tells him how much she regretted going to the prom with\nArtie instead of him, causing Homer to somewhat repair the strap of her dress with the corsage he got\nher. After that decision, her sisters showed their discontent towards him and ultimately thinks he was just\nwrong for her. However, Selma does show that she is willing to make a sincere attempt to like Homer for\nMarge's"}
{"filename": "Homer-Simpson", "question": "Where does Homer work?", "start_in_document": 706, "answer_text": "low-level safety inspector at the\nSpringfield Nuclear Power Plant", "start_in_context": 706, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": "Who is the wife of Homer?", "start_in_document": 121, "answer_text": "Marge Simpson", "start_in_context": 121, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Marge-Simpson", "question": "What is the hair color of Marge?", "start_in_document": 10146, "answer_text": "dark-blue", "start_in_context": 1365, "answer_correct": true, "feedback_type": "qa", "context": "wishes and demands have led to trouble at the expense\nof her family such as:\nForcing Homer and Larry Burns to turn themselves in, after they fake a kidnapping even though it\nwas broad daylight and the news chopper was nearby. [31]\nForcing Bart to apologize to Lisa for \"making her\" miss the Isis exhibit, due to Marge backing out\non her promise to take her there, in order to get the comedy props that Bart glued to his face\nremoved. [32]\nForcing Bart to attend Nelson's birthday party, after he convinces his classmates not to go. [33]\nPlaying Maggie's Roofie CD 24 hours a day around the house despite everyone else showing\nobvious hatred of it. [34]\nSending money and a letter revealing her husband's crime to a film studio getting him arrested for\nCopyright Infringement. [35]\nOver parenting Bar by following him everywhere be-it through his cell phone or going to school\nwith him.\nDespite many of Springfield's occasional riots and animosity against any given member of the Simpson\nfamily, Marge is still shown to be very trusting, even towards her fair-weathered friends and\nacquaintances who criticize her family and her tastes on a weekly basis. Marge is definitely extremely\nunappreciated by her own children and husband. She constantly slaves over the children and Homer by\ncleaning up the messes they leave.\nPhysical appearance\nMarge has yellow skin and dark-blue hair styled into a tall curly beehive hairstyle. She usually wears a\nlong strapless pale olive-green dress, orange low-heeled shoes, and a red pearl necklace. The necklace\nis a family heirloom, and she is seen to have a big drawer full of them. [36] Doctor Hibbert revealed that\nshe has webbed toes in \"Marge in Chains\". Marge remarked that she used to have a \"perfect 26-26-26\"\nfigure. [37] Later seasons have her described/depicted as very beautiful and physically attractive, and she\nhas been sought"}
{"filename": "Bart-Simpson", "question": "Who is the best friend of Bart?", "start_in_document": 3013, "answer_text": "Milhouse Van\nHouten", "start_in_context": 578, "answer_correct": true, "feedback_type": "qa", "context": "Lisa, playing video games, helping Lisa solve various problems (e.g.\nreuniting Krusty with his estranged Father), and pulling off various pranks, (such as mooning\nunsuspecting people, prank calling Moe at his tavern, and his patented spitting off an overpass). Bart\nalso sprays graffiti under the alias 'El Barto', and regularly frequents the Kwik-E-Mart (for bubble gum\nand Squishees) and The Android's Dungeon. Yuma Hickman moved to Springfield when Marge was\npregnant with Bart.\nBart hinted that his favorite movies are Jaws and the Star Wars trilogy.[13] His best friend is Milhouse Van\nHouten.\nDate of birth inconsistency\nIn \"My Sister, My Sitter”, it is stated that Lisa is 2 years and 38 days younger than Bart. In \"Mr. Lisa's\nOpus\" and on the show's official Instagram account, Lisa's birthday is revealed to be on May 9, putting\nBart's birthday on April 1. However, in \"Simpsorama\", Bart states that his birthday is on February 23rd.\nBehavior\nBart is a kindhearted, loyal and energetic, but sometimes very rowdy and mischievous boy.\nBart is a notorious prankster at Springfield Elementary, and his pranks are often elaborately complex, but\ncan lead to unfortunate consequences. Bart's overall intelligence, like his mother's, has been shown to\nfluctuate slightly over the course of the series. It has been shown anywhere from being just above his\nfather's level, to being just below, or (on the rare occasion that he shows interest or is willing to pay\nattention) exceeding that of his sister. Despite his behavior, Bart is also extremely good at science, art\nand even sports like skateboarding. His actions and speech frequently show considerable mental agility,\nstreet-smarts, and understanding. When Bart became a hall monitor for Springfield Elementary, his\ngrades went up, showing that he only struggles because he does not pay any attention.[14] Bart has\nADHD.["}
{"filename": "Bart-Simpson", "question": "What is the nemesis of Bart?", "start_in_document": 26990, "answer_text": "Sideshow Bob", "start_in_context": 322, "answer_correct": true, "feedback_type": "qa", "context": "Bart also seems to acknowledge Lisa as his better when it comes\ndown to solving problems (even though he was instrumental in rescuing snakes on Whacking Day and\nretrieving his father's Hive grill) and frequently goes to her for advice. Both siblings formed a dynamic\ncrime-solving duo during many of their encounters with Sideshow Bob, Bart's nemesis. At one time, he\nenters a series of robot battles with his robot: Chief Knock-a-Homer (which is Homer as the robot hoping\nto gain Bart's trust), and tries to cheer up Lisa when Snowball II dies. Also, in \"Simpsons Roasting on an\nOpen Fire\" and \"Holidays of Future Passed, he tells Lisa that she's the person Bart has always wanted\nto be.\nMaggie\nArguably, Bart's best relationship with his family is with Maggie, as they more often than not get along\nquite well (mostly because she is a baby). Bart's shine to Maggie has come in the form of his pulling\nvarious pranks with her, playing and bonding with her after he and Milhouse were separated for a time,\nand at one point square-dancing with her at a Dude Ranch.\nFriends\nWhile being disliked by most adults, Bart is rather popular with other kids and has very many friends at\nhis school. His closest friend is Milhouse Van Houten; Bart's other friends include Nelson Muntz, Lewis,\nRichard, Bashir bin Laden, Nikki McKenna, Jessica Lovejoy, Donny, Laura Powers and even the less\fsocially desirable children of his school, such as Ralph Wiggum, Martin Prince, Database, and Wendell\nBorton.\nMilhouse Van Houten\nOut of all of them, Bart's best friend is Milhouse Van Houten. Though the two are close friends, Bart has\naccidentally put Milhouse into trouble countless times throughout the series, with more than one\noccasion causing physical harm to Milhouse due to Bart's lack of regard for Milhouse's safety. At one\ntime, Bart was driving"}
{"filename": "Homer-Simpson", "question": "Who are the parents of Homer Simpson?", "start_in_document": 149, "answer_text": "Bart, Lisa and Maggie Simpson", "start_in_context": 149, "answer_correct": false, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": "Who are the parents of Homer Simpson?", "start_in_document": 1742, "answer_text": "Abraham Simpson II and Mona Olsen", "start_in_context": 542, "answer_correct": true, "feedback_type": "qa", "context": "Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non the Simpson family farm until they were forced to move out due to Homer jumping out of a hay bale\nand scaring the cows into giving sour milk, causing the bank to foreclose it. At some point in his\nchildhood, Homer began drinking alcohol like his father and accidentally caused a traffic jam in a\nPlayskool car. According to a family tree designed by the creator of the show, Matt Groening, Mr. Burns,\nhis boss, is a distant relative of him.\nHis father forced him to attend Camp See-A-Tree, where he went on a date with Marge Bouvier from\nCamp Land-A-Man; unfortunately, he lied about his name and sustained an injury while Marge changed\nher appearance. Homer then accidentally stumbled into Camp Flab-Away and escaped too late to meet\nwith her again, something that left him as heartbroken as Marge.[43]\nWhen Homer was around twelve, his mother went into hiding following a run-in with the law and Abe\nfaked her death[44]; before that, she took Homer and Abe to Woodstock, where he ended up briefly\nadopting the hippie lifestyle, much to Abe's disapproval. Homer, along with Lenny, Carl, and Moe, went\nto a deep gorge to swim but the water was drained. When investigating why the lake was reduced to a"}
{"filename": "Selma-Bouvier", "question": "Marge's color hair", "start_in_document": 2039, "answer_text": "grey", "start_in_context": 819, "answer_correct": false, "feedback_type": "qa", "context": "mother, Jacqueline, due to Jacqueline's\ndislike of Jub-Jub. Unlike Patty, Selma is very desperate to find love after seeing her Aunt Gladys' video will.\nShe also asks Marge for advice to find love, saying that Patty is two minutes younger than she is.\nSelma's favorite brand of cigarettes is identified as \"Laramie Hi-Tars\" while Patty's favorite brand of cigarettes\nis \"Lady Laramie 100s\"; they have been claimed by their mother to \"have started smoking even before birth\". It\nis shown that Patty and Selma started smoking as children when they gave their allowances to Marge (she\nwould do their chores), and with all the free time they had, they took up smoking. The twins had melodic\nvoices prior to starting smoking, and their trademark harsh voices after [5]. The smoke and ash from the\ncigarettes turned her hair grey, originally blond. Since Patty is not a blond, but a redhead, this would make\nthem fraternal twins. Patty and Selma share an apartment at the Spinster City Apartments complex and work\nat the Department of Motor Vehicles (DMV). They have on numerous occasions acted unprofessionally in the\ncourse of their jobs, such as smoking indoors, giving out licenses to unqualified drivers, or flirting with the\ncustomers (although Patty was eventually revealed to be a lesbian and didn’t tell Marge right away due to fear\fof Marge’s reaction. While Marge seems unsure at first, she eventually accepts Patty after saving her from a\nfraudulent marriage).\nSelma and Patty have an avid (sometimes maniacal) love of the television show MacGyver. Selma nearly\nbroke off her engagement with Sideshow Bob because he disliked the show, and both Patty and Selma stay\nup until 2:00 in the morning to watch the show. Patty and Selma also have an interest in traveling. They have\nvisited Egypt, Lenin's Tomb in Russia, Easter Island, France, Mexico, and more mundane places, such as the\nRemington Horse Drawn Carriage"}
{"filename": "Marge-Simpson", "question": "Marge's color hair", "start_in_document": 10146, "answer_text": "dark-blue", "start_in_context": 84, "answer_correct": true, "feedback_type": "qa", "context": "by\ncleaning up the messes they leave.\nPhysical appearance\nMarge has yellow skin and dark-blue hair styled into a tall curly beehive hairstyle. She usually wears a\nlong strapless pale olive-green dress, orange low-heeled shoes, and a red pearl necklace. The necklace\nis a family heirloom, and she is seen to have a big drawer full of them. [36] Doctor Hibbert revealed that\nshe has webbed toes in \"Marge in Chains\". Marge remarked that she used to have a \"perfect 26-26-26\"\nfigure. [37] Later seasons have her described/depicted as very beautiful and physically attractive, and she\nhas been sought after by several of the men in Springfield, most notably Moe, and even some of Bart's\nfriends have noted her attractiveness.\nOn special occasions, she wears a long sleeved dress with white pearls that are very similar to Lisa's.\nAs a teen, Marge had waist-length hair that she always wore down, but wore it in her trademark beehive\nfor senior prom.[38] In flashbacks showing Marge as a child, she is portrayed with her hair worn tall,\nwhich could mean she straightened it when she got older. Her hair is thick enough for her to keep\fobjects like the family savings in it.[39] Her hair is once shown close to her knees, consistent with the\nlogic that a lot of hair would be needed to create her tall beehive.[40] It was revealed by Homer that\nMarge dyes her hair with blue dye #56, stating \"She’s been gray as a mule since she was seventeen.\"\n[41] Marge herself has made reference to blue not being her natural color, telling this once to the private\ncamera on a reality TV show. Though, she obviously doesn't want anyone to know this as she instantly\ntried to steal the tape.[42] Because of her unusually large hairstyle, her height is reported to be 8'6\", as\nnoted"}
{"filename": "Homer-Simpson", "question": "Where does Homer work?", "start_in_document": 4583, "answer_text": "Sir Putt-A-Lot's Merrie Olde Fun Centre", "start_in_context": 927, "answer_correct": false, "feedback_type": "qa", "context": "presumably failed his SAT tests.[45]\nHomer attended Springfield High School, falling in love with an older and unrecognizable Marge after\nshe ultimately rejected Artie Ziff.[46] After finishing (but not graduating from) high school, Marge and\nHomer bought an apartment at Springfield Place together. During this time, Marge got a letter accepting\nher into a college. To pay for her tuition, Abe gave his son a job at Simpson Laser Tag. The couple broke\nup for some time after Homer started a grunge band called Sadgasm. Marge later realized that she\nreally loved Homer and went back to him.[47] At some point between finishing high school and marrying\nMarge, Homer briefly served in the U.S. Army but never saw combat. Due to a clerical error, he was\ndischarged early, and years later, after a disastrous dinner party with his old sergeant, Homer was forced\nto complete his tour of duty.\nIn his early 20s, Homer was working at Sir Putt-A-Lot's Merrie Olde Fun Centre, turning the crank that\nspun the windmill. After a night out with Marge, he learned that he'd prematurely impregnated her with\ntheir first child, who they decided to name \"Bart\" if it was a boy. He got married with Marge at Shotgun\nPete's, a small wedding chapel across the state line. They spent their wedding reception alone at a truck\nstop before ending up at the Bouvier house.\fAfter failing to get a job at the power plant, Homer eventually left Marge to support his family. He went to\nwork at the restaurant Gulp 'n' Blow until Marge convinced him to return home with her. As a result,\nHomer confronted Charles Montgomery Burns and secured a job at the plant.[48] Two years after Bart\nwas born, Marge became pregnant again with Lisa shortly before they bought their first house.[49]\nHomer's second leap to stardom was his success as the lead singer and songwriter for the barbershop"}
{"filename": "Homer-Simpson", "question": "Where does Homer work?", "start_in_document": 4583, "answer_text": "Sir Putt-A-Lot's Merrie Olde Fun Centre", "start_in_context": 927, "answer_correct": false, "feedback_type": "qa", "context": "presumably failed his SAT tests.[45]\nHomer attended Springfield High School, falling in love with an older and unrecognizable Marge after\nshe ultimately rejected Artie Ziff.[46] After finishing (but not graduating from) high school, Marge and\nHomer bought an apartment at Springfield Place together. During this time, Marge got a letter accepting\nher into a college. To pay for her tuition, Abe gave his son a job at Simpson Laser Tag. The couple broke\nup for some time after Homer started a grunge band called Sadgasm. Marge later realized that she\nreally loved Homer and went back to him.[47] At some point between finishing high school and marrying\nMarge, Homer briefly served in the U.S. Army but never saw combat. Due to a clerical error, he was\ndischarged early, and years later, after a disastrous dinner party with his old sergeant, Homer was forced\nto complete his tour of duty.\nIn his early 20s, Homer was working at Sir Putt-A-Lot's Merrie Olde Fun Centre, turning the crank that\nspun the windmill. After a night out with Marge, he learned that he'd prematurely impregnated her with\ntheir first child, who they decided to name \"Bart\" if it was a boy. He got married with Marge at Shotgun\nPete's, a small wedding chapel across the state line. They spent their wedding reception alone at a truck\nstop before ending up at the Bouvier house.\fAfter failing to get a job at the power plant, Homer eventually left Marge to support his family. He went to\nwork at the restaurant Gulp 'n' Blow until Marge convinced him to return home with her. As a result,\nHomer confronted Charles Montgomery Burns and secured a job at the plant.[48] Two years after Bart\nwas born, Marge became pregnant again with Lisa shortly before they bought their first house.[49]\nHomer's second leap to stardom was his success as the lead singer and songwriter for the barbershop"}
{"filename": "Homer-Simpson", "question": "Where does Homer work?", "start_in_document": 740, "answer_text": "Springfield Nuclear Power Plant in Sector 7G", "start_in_context": 740, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Bart-Simpson", "question": "Who are Bart's siblings?", "start_in_document": 291, "answer_text": "Lisa\nand Maggie", "start_in_context": 291, "answer_correct": true, "feedback_type": "qa", "context": "Bart Simpson\nBart Simpson\nBartholomew JoJo \"Bart\" Simpson (born April 1,\n1979)[7]is the mischievous, rebellious, misunderstood,\ndisruptive and \"potentially dangerous\" oldest child of the\nSimpson family in The Simpsons. He is the only son of\nHomer and Marge Simpson, and the older brother of Lisa\nand Maggie. He also has been nicknamed \"Cosmo\", after\ndiscovering a comet in \"Bart's Comet\". Bart has also been\non the cover on numerous comics, such as \"Critical Hit\",\n\"Simpsons Treasure Trove #11\", and \"Winter Wingding\".\nBart also has a 100-issue comic series entitled the\nSimpson Comics Presents Bart Simpson. Bart is loosely\nbased on Matt Groening and his older brother, Mark\nGroening.\nEven at a young age, Bart has accomplished many feats.\nHe has won an award for his Angry Dad web series[8], he\nhas discovered a new comet which was named after\nhim[9], and he also has performed in a successful band\nwith Milhouse Van Houten, Nelson Muntz, and Ralph Wiggum.[10]\nDescription\n“Bart is the dangerous eldest child of Homer and Marge. He is sometimes called El Barto.”\nBiography\nBart is a self-proclaimed underachiever and prankster who is constantly in detention, and, in addition to\nhis behavior, is easily distracted. He is the most misunderstood of the family (after Maggie, who currently\ncan only speak a few words), constantly frustrated by the narrow-minded people of Springfield, who\njudge him merely by his thoughts and actions.\nHis penchant for shocking people began before he was born, Bart \"mooned\" Dr. Hibbert while he\nperformed a sonogram on Marge when she was pregnant with him, and moments after being born, he\nset Homer's tie-on fire, starting his life as a prankster (although Marge claimed that he could not have\fdone it on purpose because he was only ten minutes old)[11]. Bart's first words were \"Ay Caramba\"[12"}
{"filename": "Homer-Simpson", "question": " who is the wife of homer", "start_in_document": 121, "answer_text": "Marge Simpson", "start_in_context": 121, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Marge-Simpson", "question": "What is Marge's birth name?", "start_in_document": 90, "answer_text": "Bouvier", "start_in_context": 90, "answer_correct": true, "feedback_type": "qa", "context": "Marjorie Jacqueline \"Marge\"\nSimpson\nMarge Simpson\nMarjorie Jacqueline \"Marge\" Simpson (née\nBouvier)[11] is the homemaker and matriarch of the\nSimpson family. She is also one of the five main\ncharacters in The Simpsons TV series. She and her\nhusband Homer have three children: Bart, Lisa, and\nMaggie. Marge is the moralistic force in her family and\noften provides a grounding voice in the midst of her\nfamily's antics by trying to maintain order in the Simpson\nhousehold. Aside from her duties at home, Marge has\nflirted briefly with a number of careers ranging from a\npolice officer to an anti-violence activist.\nBiography\nEarly life\nMarge Bouvier was born on in Capital City to Clancy\nBouvier, a photographer-turned-steward, and Jacqueline\nBouvier. She is the youngest daughter of the Bouvier\nfamily. She has a pair of older sisters, the joyless twins,\nPatty and Selma, both of whom passionately disapprove\nof Homer.\nTitles and Styles\nH.S.H/Her Serene Highness, the Princess Consort of Springfield, Duchess of Bouvier and Countess of\nSimpson.\nMeeting Homer\nMarge attended Springfield High School and in her senior year, she met Homer Simpson. She was wary\nof Homer at first but agreed to have a study date with him, only to find out that Homer was only doing\nthis to get her to go to prom with him. She ended up going with Artie Ziff. She regrets going with Artie\nbecause he tried to have sex with her afterward. Artie takes her home and she later picks up Homer,\nwho she finds walking home, in her car. Marge tells him how much she regretted going to the prom with\nArtie instead of him, causing Homer to somewhat repair the strap of her dress with the corsage he got\nher. After that decision, her sisters showed their discontent towards him and ultimately thinks he was just\nwrong for her. However, Selma does show that she is willing to make a sincere attempt to like Homer for\nMarge's"}
{"filename": "Marge-Simpson", "question": "Who are Marge's sisters", "start_in_document": 4364, "answer_text": "Patty and Selma", "start_in_context": 550, "answer_correct": true, "feedback_type": "qa", "context": "share of wild escapades throughout the history of the\nseries. She worked as a police officer in Springfield,[12] took therapy for flight fear,[13]was a real estate\nagent, sold pretzels, was a painter, was imprisoned for shoplifting,[14] became a gambling addict,[15]\nshowed alcoholic tendencies,[16]was at one time known as The Listen Lady, was an unwilling participant\nin a cross-country police chase,[17] overdosed on steroids,[18] cheated on a cooking competition[19] and\ndeveloped amnesia.[20] Although not a chain smoker like her eldest sisters Patty and Selma, Marge has\nengaged in smoking twice. One of these times, however, she was implied to be an attempt to drown out\nthe smell of the Annual Chili Cook-Off to hide it from Homer as long as possible due to realizing if he was\nto find out he had immediately wanted to go there, as she was motivated to go with Homer after their last\nvisit resulted in humiliation on her part when Homer, while drunk, stripped naked and proceeded to\n\"bathe\" himself in a cotton candy maker under the delusion he was a puffy pink cloud.[21]\fCriminal record\nShoplifting: In \"Marge in Chains\", Marge steals from the Kwik-E-Mart without paying prior,\nprompting her imprisonment.\nDrug abuse: Marge overdoses on steroids in \"The Strong Arms of the Ma\".\nChild negligence: In \"Orange is the New Yellow\", Marge is arrested for letting Bart go to the park\nwithout parental supervision. In \"$pringfield\", Maggie wandered away due to Marge's gambling\naddiction, and was nearly eaten by Anastasia (if Barney didn't save her).\nManslaughter: In \"The Debarted\", Marge accidentally crashes into Hans Moleman's car, causing it\nto trigger the airbag and smother him.\nRape: In \"The Strong Arms of the Ma\" she rapes Homer.\nFarming marijuana - In \"The Kids Are All Fight\", Marge stated that she"}
{"filename": "Marge-Simpson", "question": "Who are Marge's children", "start_in_document": 276, "answer_text": "Bart, Lisa, and\nMaggie", "start_in_context": 276, "answer_correct": true, "feedback_type": "qa", "context": "Marjorie Jacqueline \"Marge\"\nSimpson\nMarge Simpson\nMarjorie Jacqueline \"Marge\" Simpson (née\nBouvier)[11] is the homemaker and matriarch of the\nSimpson family. She is also one of the five main\ncharacters in The Simpsons TV series. She and her\nhusband Homer have three children: Bart, Lisa, and\nMaggie. Marge is the moralistic force in her family and\noften provides a grounding voice in the midst of her\nfamily's antics by trying to maintain order in the Simpson\nhousehold. Aside from her duties at home, Marge has\nflirted briefly with a number of careers ranging from a\npolice officer to an anti-violence activist.\nBiography\nEarly life\nMarge Bouvier was born on in Capital City to Clancy\nBouvier, a photographer-turned-steward, and Jacqueline\nBouvier. She is the youngest daughter of the Bouvier\nfamily. She has a pair of older sisters, the joyless twins,\nPatty and Selma, both of whom passionately disapprove\nof Homer.\nTitles and Styles\nH.S.H/Her Serene Highness, the Princess Consort of Springfield, Duchess of Bouvier and Countess of\nSimpson.\nMeeting Homer\nMarge attended Springfield High School and in her senior year, she met Homer Simpson. She was wary\nof Homer at first but agreed to have a study date with him, only to find out that Homer was only doing\nthis to get her to go to prom with him. She ended up going with Artie Ziff. She regrets going with Artie\nbecause he tried to have sex with her afterward. Artie takes her home and she later picks up Homer,\nwho she finds walking home, in her car. Marge tells him how much she regretted going to the prom with\nArtie instead of him, causing Homer to somewhat repair the strap of her dress with the corsage he got\nher. After that decision, her sisters showed their discontent towards him and ultimately thinks he was just\nwrong for her. However, Selma does show that she is willing to make a sincere attempt to like Homer for\nMarge's"}
{"filename": "Homer-Simpson", "question": "Where does Homer work?", "start_in_document": 603, "answer_text": "Springfield Nuclear Power Plant in Sector 7G", "start_in_context": 603, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": "What is Homer's job?", "start_in_document": 706, "answer_text": "low-level safety inspector", "start_in_context": 706, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Bart-Simpson", "question": "Name the Simpson's dog", "start_in_document": 10876, "answer_text": "Santa's Little Helper", "start_in_context": 852, "answer_correct": true, "feedback_type": "qa", "context": "is when he was framed for a prank at a medieval festival held at school and was expelled\nfor it (the actual culprit was Groundskeeper Willie) but he was welcomed back as an apology[24], and a\nnotable example of the latter was when both he and Milhouse ended up permanently (at the time)\nbanned by Comic Book Guy from the Androids Dungeon because Bart and Milhouse talked Mrs. Prince\nout of selling him rare and invaluable Star Wars memorabilia that belonged to Martin Prince for what was\nobviously a ripped off price.[25]\nAlthough Lisa is a vegetarian, Bart is the real animal lover in the family. He becomes extremely attached\nto animals that fall under his care and will, most of the time, save animals that he feels will be hurt or\nelse will go to great lengths to protect them. Some of Bart's favorite pets include: his dog (and best\nfriend) named Santa's Little Helper, a snake named Strangles, an elephant named Stampy, a racehorse\nnamed Duncan, a nest of bird-eating lizards named Chirpy Boy and Bart Junior, Santa's Little Helper's\ngreyhound puppies and a cow named Lou, for whom he was willing to prematurely marry in order to\nspare from the slaughterhouse.\nCriminal record\nIndecent exposure: In The Simpsons Movie, Bart is dared by Homer to skateboard from home to\nKrusty Burger completely naked. Chief Wiggum notices this and chains Bart to a lamppost by the\nrestaurant.\nHarassment over Telephone: Bart makes prank calls to Moe at his tavern as a running gag.\nAssault with a Deadly Weapon: Throughout the subplot of \"Please Homer, Don't Hammer 'Em\",\nBart tries to trigger Skinner's allergies.\nArson: Bart once accidentally burned down his Christmas tree when opening gifts early, and then\nlied about it. In addition, while he was not actually responsible for this instance, he unknowingly\ntakes the heat for the charge of arson in order to allow Nelson Muntz, the actual culprit, to win"}
{"filename": "Snowball-V-Simpsons", "question": "Name the Simpson's cat", "start_in_document": 0, "answer_text": "Snowball V", "start_in_context": 0, "answer_correct": true, "feedback_type": "qa", "context": "Snowball V (Snowball II)\nSnowball V\nSnowball V is the Simpsons' fifth cat who looks exactly\nthe same as Snowball II, who was accidentally struck and\nkilled by Dr. Hibbert with his Mercedes-Benz. The Crazy\nCat Lady throws the cat at Lisa while she is mourning the\ndeaths of the other cats that she kept (Snowball III and\nColtrane (Snowball IV). She, Santa's Little Helper and\nShe Biscuit are the three current pets of the Simpson\nfamily. She is actually known as Snowball II.\nBiography\nAfter the Crazy Cat Lady throws the cat at her feet saying that she doesn't want it anymore, Lisa tells it\nto leave, because she believes any cat that she owns is unlucky and is certain to be killed. As the cat\nstarts to cross Evergreen Terrace, Gil drives by in his car. Gil swerves to miss the cat, hits a tree, and his\ncar bursts into flames, which means that Gil will be able to use the insurance money to buy food. Since\nthe cat is unhurt, Lisa takes it as a sign of good luck and adopts her.[2]\nLisa renames Snowball V \"Snowball II,\" in her words, \"to save money on a new dish.\" She also vows to\npretend the whole thing never happened (i.e., two adopted cats dying in quick succession). Principal\nSkinner, who happens to be walking by and overhears Lisa talking to the cat, asks \"Isn't that a cheat?\",\nto which Lisa replies \"I guess it is, Principal Tamzarian\" (referring to when he admitted he was not the\nreal Seymour Skinner, while knowing that the citizens of Springfield should never speak of that again).[3]\nThe cat later becomes very overweight after abandoning the Simpsons for brief periods to visit a\ndifferent family. At the other family's house, she is fed, taught tricks and given the name \"Smokey\".[4]\nThere is suspicion that Snowball V is in fact the new and improved"}
{"filename": "Lisa-Simpson", "question": "Lisa's hobbies", "start_in_document": 752, "answer_text": "playing saxophone and guitar,\nriding and caring for horses, and interest in advanced\nstudies", "start_in_context": 752, "answer_correct": true, "feedback_type": "qa", "context": "Lisa Marie Simpson\nLisa Simpson\nLisa Marie Simpson (born May 9, 1981)[9] is the elder\ndaughter and middle child of the Simpson family and one\nof the two tritagonists (along with Marge,) of The\nSimpsons. She was named after a train called Lil' Lisa on\nher parents' 1st anniversary; in \"Homer and Lisa\nExchange Cross Words\", she called herself Lisa Bouvier\nafter estranging herself from her father after he bet\nagainst her in a crossword tournament.\nLisa Simpson is a charismatic 8-year-old girl who exceeds\nthe standard achievement of the intelligence level of\nchildren her age. Not to everyone's surprise, she is also\nthe moral center of her family. In her upbringing, Lisa\nlacks parental involvement of Homer and Marge, which\nleads to hobbies such as playing saxophone and guitar,\nriding and caring for horses, and interest in advanced\nstudies. In school, Lisa's popularity is affected by those\nwho view her as a geeky overachiever, which leaves her\nwith only a few friends. She focuses on her goals and\nstrives to reach her potential, and at the age of eight, she\nis already a member of Mensa with an IQ of 159. Her lack of parental involvement also leads to her\nlashing out at those who she deems lower than her or even above her. She has extreme jealousy from\ntime to time and will do whatever it takes to reclaim her title as the smartest; but only if she deems it\nnecessary. Otherwise, she's the intelligent and rational one who usually thinks things through.\nBiography\nLisa is quite eclectic in her knowledge and is notably more concerned with world affairs and problems\nthan her cohorts, which has led her to alienate herself from her peers. Lisa also deeply values her\nintegrity, sometimes at the expense of others' needs and happiness, as demonstrated when she cheats\non a test in The Wind in the Willows to attain her highest grade of A-plus, but later admits her dishonesty\nto an unreceptive Principal Skinner despite"}
{"filename": "Bart-Simpson", "question": "Bart's hobbies", "start_in_document": 47385, "answer_text": "skateboarding, jockeying, lassoing, and tennis", "start_in_context": 1893, "answer_correct": true, "feedback_type": "qa", "context": "peanut allergy and by making him either remain still or\nperform difficult tasks when he (Bart) and his fellow students took over the school.\nBart is also very talented at craftsmanship. He once made a replica of himself to take his place in class\nand also one of Lisa so that he and the rest of his school could fool the state's comptroller.\nBart has also demonstrated skill in regards to fighting prowess despite every now and then being beaten\nhimself. At one point, after graduating from military school, he remarked that he is now a master of\ndifferent forms of unarmed combat. He managed to hold his own in a fight with a girl highly-trained in\nKrav Maga and actually managed to get the better of Nelson on at least a couple of occasions (during a\nfight on the school playground and when he was working with his sister to stop the bullies from pulling a\nserious prank). At another instance, after challenging the fifth graders to a rumble, he easily caught a\npunch from the much-larger fifth-grade leader before noticing a scar on his hand. Though in a dream-like\nsequence and during a tree house of horror segment, Bart showed exceptional combat skill when he\neffortlessly pummeled 10 and 20-year-old versions of his father and when he easily overpowered an\nonslaught of Springfieldians while working for Moe as a secret agent. Bart has also shown rather\fadmirable skill in armed combat, as he fought roughly on par with Skinner, a trained and experienced\nformer Green Beret, in a stick fight that spilled throughout Springfield.\nBart can also play a great game of putt-putt. He once almost won a miniature golf tournament against\nTodd Flanders. At the eighteenth hole, both boys decided the stress that each other's father was putting\non them wasn't worth it and decided to take a tie and split the fifty-dollar prize.[57] Other recreational\nactivities in which he shows talent include skateboarding, jockeying, lassoing, and tennis.\nBart"}
{"filename": "Patty-Bouvier", "question": "Who do Patty and Selma love?", "start_in_document": 6157, "answer_text": "MacGyver", "start_in_context": 43, "answer_correct": true, "feedback_type": "qa", "context": "like Selma, expressed a sexual fixation on MacGyver for many years, (although after she came out it\nwould appear that she was only going along with Selma's feelings for him) even though this aspect of\nher personality was phased out in later years. Other than MacGyver, she alongside her sister also may\nhave raped a TV repairman.[23] In addition, she also was at least familiar enough with heterosexual\nrelationships that she taught a dating class for single women on how to land men, although thanks to her\nand her sister's less than appealing appearances, the students were left disgusted with their advice, with\nPatty opportunistically stating there won't be any refunds if they decide to leave the course.\nPatty's only notable relationship with a woman, however, has been with Veronica, who was a\nprofessional golfer. However, it was later discovered by Marge and revealed during Patty's wedding that\nVeronica was in truth a man named Leslie.[24]When Marge reveals this to Patty, Patty thinks Marge is\nbeing homophobic, but Leslie reveals that he is indeed a man. The wedding is called off, and the two\nsisters make up, with Marge saying that being a lesbian \"doesn't make you less of a bein'\". Patty then\ngoes home with Selma. In the Clown Without Pity segment of \"Treehouse of Horror III\", as Homer runs\nnaked in fear from the evil Krusty Doll, Patty mentions that the last thread of her heterosexuality was\ntorn, possibly an early sign of her sexuality (with Homer unwittingly causing it).\nDi�erences with Selma\nPatty's hair is round, while Selma's is M-shaped.\nPatty wears a pink dress, with pink shoes and blue triangle earrings and orange or blue spherical\nbeads while Selma wears purple or orange elliptical beads. However, some older episodes have a\ncolor glitch, with Patty’s dress and shoes being a purple or coral color.\nPatty is a red-head, Selma, on"}
{"filename": "Mona-Simpson-Sunny", "question": "Who is Mona Simpson?", "start_in_document": 35, "answer_text": "Mona Penelope Simpson (née Olsen), also known as\nmother of Homer Simpson, mother-in-law of Marge\nSimpson, paternal grandmother of Bart, Lisa and Maggie\nSimpson and ex-wife of Abraham Simpson II", "start_in_context": 35, "answer_correct": true, "feedback_type": "qa", "context": "Mona Penelope Simpson\nMona Simpson\nMona Penelope Simpson (née Olsen), also known as\nmother of Homer Simpson, mother-in-law of Marge\nSimpson, paternal grandmother of Bart, Lisa and Maggie\nSimpson and ex-wife of Abraham Simpson II.\nPersonality\nMona was strong-willed, righteous and caring, always\ndoing what she knew or thought was the right thing no\nmatter what. She cherished the relationship she had with\nher son and later her grandchildren and daughter-in-law.\nDespite her friendly nature, she was shown to hold\ndistaste for her ex-husband and Homer's father Abe due\nto his irritability, intolerance and questionable parenting\nmethods concerning their son, even berating him for\ntelling Homer she had died. She also disapproved of\nthose with ill intentions, as seen when she joined a radical\ngroup protesting biological warfare experiments and other\nunscrupulous activities by Charles Montgomery Burns.\nOverall, she seemed to bring out a more vulnerable side of Homer reminiscent of the innocent child he\nwas before she left.\nEarly Years\nMona Olsen was born March 15, 1923. In the 1949 she married Abraham Simpson II.\nAt some point after her marriage she learned that Abe fathered Herbert Powell with a carnival worker\nnamed Gaby. Shortly after Homer was born, she made him promise to never talk about the incident at\nthe carnival as she wanted Homer to grow up respecting his father.[4] However, she often found herself\nlooking out for Homer while Abe could've cared less due to the circumstances of his conception,[5] much\nto her dismay.\fDuring the 1960s while Homer was a child, she became increasingly involved in hippie movements and\npolitical activism. She cited Joe Namath's long hair during Super Bowl III as igniting her beliefs. She\ntakes Homer and Abe to Woodstock, where Homer ended up being influenced by hippies. Unfortunately,\nher frequent protesting eventually led to Homer developing his eating disorder to cope with her\nabsence.[6] She and other activists protesting germ research enter a facility owned by"}
{"filename": "Homer-Simpson", "question": "What is Homer favorite snack?", "start_in_document": 488, "answer_text": "\ndonuts", "start_in_context": 488, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson.pdf", "question": "Homer's main beer supplier?", "start_in_document": 44830, "answer_text": "Moe is the owner of Moe's Tavern and is Homer's main supply of beer", "start_in_context": 0, "answer_correct": true, "feedback_type": "annotation", "context": "Moe is the owner of Moe's Tavern and is Homer's main supply of beer, making him a very important"}
{"filename": "Homer-Simpson", "question": "Who is Homer's boss", "start_in_document": 2184, "answer_text": "Mr. Burns", "start_in_context": 984, "answer_correct": true, "feedback_type": "qa", "context": "Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non the Simpson family farm until they were forced to move out due to Homer jumping out of a hay bale\nand scaring the cows into giving sour milk, causing the bank to foreclose it. At some point in his\nchildhood, Homer began drinking alcohol like his father and accidentally caused a traffic jam in a\nPlayskool car. According to a family tree designed by the creator of the show, Matt Groening, Mr. Burns,\nhis boss, is a distant relative of him.\nHis father forced him to attend Camp See-A-Tree, where he went on a date with Marge Bouvier from\nCamp Land-A-Man; unfortunately, he lied about his name and sustained an injury while Marge changed\nher appearance. Homer then accidentally stumbled into Camp Flab-Away and escaped too late to meet\nwith her again, something that left him as heartbroken as Marge.[43]\nWhen Homer was around twelve, his mother went into hiding following a run-in with the law and Abe\nfaked her death[44]; before that, she took Homer and Abe to Woodstock, where he ended up briefly\nadopting the hippie lifestyle, much to Abe's disapproval. Homer, along with Lenny, Carl, and Moe, went\nto a deep gorge to swim but the water was drained. When investigating why the lake was reduced to a"}
{"filename": "Homer-Simpson.pdf", "question": "With who does Homer drinks beers?", "start_in_document": 853, "answer_text": "He spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak.", "start_in_context": 0, "answer_correct": true, "feedback_type": "annotation", "context": "He spends a great deal of his time at Moe's Tavern with"}
{"filename": "Homer-Simpson", "question": "Homer's friends", "start_in_document": 921, "answer_text": "Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak", "start_in_context": 921, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": "Homer hobbies", "start_in_document": 473, "answer_text": "dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding", "start_in_context": 473, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Lisa-Simpson", "question": "What instrument does Lisa play", "start_in_document": 760, "answer_text": "saxophone and guitar", "start_in_context": 760, "answer_correct": true, "feedback_type": "qa", "context": "Lisa Marie Simpson\nLisa Simpson\nLisa Marie Simpson (born May 9, 1981)[9] is the elder\ndaughter and middle child of the Simpson family and one\nof the two tritagonists (along with Marge,) of The\nSimpsons. She was named after a train called Lil' Lisa on\nher parents' 1st anniversary; in \"Homer and Lisa\nExchange Cross Words\", she called herself Lisa Bouvier\nafter estranging herself from her father after he bet\nagainst her in a crossword tournament.\nLisa Simpson is a charismatic 8-year-old girl who exceeds\nthe standard achievement of the intelligence level of\nchildren her age. Not to everyone's surprise, she is also\nthe moral center of her family. In her upbringing, Lisa\nlacks parental involvement of Homer and Marge, which\nleads to hobbies such as playing saxophone and guitar,\nriding and caring for horses, and interest in advanced\nstudies. In school, Lisa's popularity is affected by those\nwho view her as a geeky overachiever, which leaves her\nwith only a few friends. She focuses on her goals and\nstrives to reach her potential, and at the age of eight, she\nis already a member of Mensa with an IQ of 159. Her lack of parental involvement also leads to her\nlashing out at those who she deems lower than her or even above her. She has extreme jealousy from\ntime to time and will do whatever it takes to reclaim her title as the smartest; but only if she deems it\nnecessary. Otherwise, she's the intelligent and rational one who usually thinks things through.\nBiography\nLisa is quite eclectic in her knowledge and is notably more concerned with world affairs and problems\nthan her cohorts, which has led her to alienate herself from her peers. Lisa also deeply values her\nintegrity, sometimes at the expense of others' needs and happiness, as demonstrated when she cheats\non a test in The Wind in the Willows to attain her highest grade of A-plus, but later admits her dishonesty\nto an unreceptive Principal Skinner despite"}
{"filename": "Lisa-Simpson", "question": "What music genre does Lisa like?", "start_in_document": 19737, "answer_text": "jazz", "start_in_context": 1627, "answer_correct": true, "feedback_type": "qa", "context": "the duo revealed that Mr. Burns was a\nliar and Mary Bailey wins in a landslide, the only known supporters being Waylon Smithers, Bart, and\nHomer. While still supportive of the Christian church she was raised in, Lisa is now a practicing Buddhist\nfollowing her decision to follow the Noble Eightfold Path.[19] Though apparently not an adherent, she\nmentions that she considers Wicca \"very empowering\".[20] She also appears to be a big believer in\nscience, even stating in one episode when she was scared of the graveyard outside her bedroom, that\nshe only believed in science.\nVegetarianism\nLisa turned ovo-lacto vegetarian due to ethical reasons.[11] This was also hinted in a flash forward in\nwhich we see Lisa as a vegetarian in the future.[21] On Paul McCartney's demand, she has stayed\nvegetarian still. According to the episode, \"The Real Housewives of Fat Tony,\" Lisa occasionally has\ntrouble adhering to the lifestyle and has needed vitamins for extra protein. She also finds the foods to\ntaste bland, she is desperate enough for tasty vegetarian foods she would force Bart to locate highly\nvaluable truffles so she could eat them instead of selling them for a lot of money. However, she will\nalways stick to her opinion that eating animals is wrong. She has made servers protest for animal rights,\nthough her family is strongly against her opinions.\nMusic\fLisa's musical abilities are extensive:, she sings with a powerful voice (she once entered a singing\ncompetition and won) and has been seen playing the acoustic six-string,[22] electric bass guitar,\naccordion and piano proficiently. But her great love is playing jazz on her baritone saxophone. Her\nmusical inclinations were nurtured by her relationship with the late jazz musician Bleeding Gums\nMurphy. She most likely inherited her musical ability from Homer, who is also musically inclined. She can\nalso play the trumpet in some intros as well as violin, tuba, and french horn.\nIndependent Learning\nShe is fluent in Italian"}
{"filename": "Maggie-Simpson", "question": "What is Maggie full name?", "start_in_document": 0, "answer_text": "Margaret Evelyn Lenny\nSimpson", "start_in_context": 0, "answer_correct": true, "feedback_type": "qa", "context": "Margaret Evelyn Lenny\nSimpson\nMaggie Simpson\nMargaret Evelyn[12] Lenny [13] \"Maggie\" Simpson (born\nJanuary 14, 1988) is the 1-year-old daughter and\nyoungest child of Marge and Homer Simpson, the baby\nsister to Bart and Lisa Simpson and one of the five main\ncharacters of The Simpsons. She is often seen sucking\non her pacifier, and when she walks, she trips over her\nclothing and falls on her face. Because she rarely ever\ntalks, Maggie is the least seen and heard in the Simpson\nfamily. Maggie is at the very young, infant age of 1.\nPersonality\nDespite being the only member of the Simpson family\nwho hasn't actually learned how to speak, Maggie is in no\nway one-dimensional and has different personality layers.\nShe appears to be somewhat detached from the rest of\nher family and is once described as \"the forgotten\nSimpson\" by Homer. When she, Bart and Lisa were shipped to a foster home at the Flanders' after their\nparents were deemed unfit, Maggie was the quickest to adapt and almost joined them until Marge called\nfor her and Maggie \"became a Simpson again.\"\nMaggie shows a stronger devotion to her mother than her father, possibly because Marge is always at\nhome or shopping with her while Homer is mostly at work or Moe's Tavern. Once, when Homer tried to\nbond with her, she tried to run away. She developed a father-daughter relationship with Moe, who once\nsaved her life. However, she does love Homer and has more than once saved his life. Not to mention\nshe said her first word, \"Daddy\" after Homer tucked her in, although no one heard her.\nAt the beginning Maggie seemed to rely on Marge and the likewise but eventually became fiercely\nindependent as she was able to plan a Great Escape-style breakout from a daycare center to get all the\nbabies' pacifiers back, which were being held under lock and key. Although treated by almost everyone"}
{"filename": "Maggie-Simpson", "question": "Maggie birth date", "start_in_document": 99, "answer_text": "January 14, 1988", "start_in_context": 99, "answer_correct": true, "feedback_type": "qa", "context": "Margaret Evelyn Lenny\nSimpson\nMaggie Simpson\nMargaret Evelyn[12] Lenny [13] \"Maggie\" Simpson (born\nJanuary 14, 1988) is the 1-year-old daughter and\nyoungest child of Marge and Homer Simpson, the baby\nsister to Bart and Lisa Simpson and one of the five main\ncharacters of The Simpsons. She is often seen sucking\non her pacifier, and when she walks, she trips over her\nclothing and falls on her face. Because she rarely ever\ntalks, Maggie is the least seen and heard in the Simpson\nfamily. Maggie is at the very young, infant age of 1.\nPersonality\nDespite being the only member of the Simpson family\nwho hasn't actually learned how to speak, Maggie is in no\nway one-dimensional and has different personality layers.\nShe appears to be somewhat detached from the rest of\nher family and is once described as \"the forgotten\nSimpson\" by Homer. When she, Bart and Lisa were shipped to a foster home at the Flanders' after their\nparents were deemed unfit, Maggie was the quickest to adapt and almost joined them until Marge called\nfor her and Maggie \"became a Simpson again.\"\nMaggie shows a stronger devotion to her mother than her father, possibly because Marge is always at\nhome or shopping with her while Homer is mostly at work or Moe's Tavern. Once, when Homer tried to\nbond with her, she tried to run away. She developed a father-daughter relationship with Moe, who once\nsaved her life. However, she does love Homer and has more than once saved his life. Not to mention\nshe said her first word, \"Daddy\" after Homer tucked her in, although no one heard her.\nAt the beginning Maggie seemed to rely on Marge and the likewise but eventually became fiercely\nindependent as she was able to plan a Great Escape-style breakout from a daycare center to get all the\nbabies' pacifiers back, which were being held under lock and key. Although treated by almost everyone"}
{"filename": "Marge-Simpson", "question": "Is Marge strong?", "start_in_document": 15194, "answer_text": "occasionally displays superhuman strength", "start_in_context": 1612, "answer_correct": true, "feedback_type": "qa", "context": "during the mayoral elections, however, appears to be a Republican,\nunlike Lisa who's a liberal progressive Democrat.\nSkills and Abilities\nPainting\nMarge is a very talented painter. When she was a teenager, she had an intense crush on Ringo Starr\nand painted a large number of portraits of him. She also wrote to Starr, but only received a reply 25\nyears later. After Homer discovered her old paintings, Lisa encouraged Marge to enroll in an art contest\nin which her portrait of a drunk Homer asleep on the couch won a local art competition. She was then\nhired by Mr. Burns to paint a portrait of the tycoon. After many attempts, she almost gave up until a\nbelated response from Ringo Starr (stating that she had talent) inspired her to continue. The resulting\nportrait won even Mr. Burns’ praise, a massive feat in itself, and was placed at the Springfield Art\fMuseum's Burns Wing[45]. In fact, she does show artistic prowess in other areas, such as being able to\nmake life-size sculptures of many of her peers out of Popsicle sticks[46].\nCooking\nMarge is also a very talented cook. She once opened up a pretzel business, but it flourished after fewer\npeople came. She usually cooks the family's meals, but sometimes Homer cooks the family's meals,\nwith Bart, Lisa, and Maggie sometimes cooking the meals. It is revealed in one episode, she entered a\ncooking contest during her high school years but made a few mistakes. She learned from them and\nbecame the family cook. Now with kids and a husband, she still demonstrates her \"chef-like skills\" and\nonce made some amazingly delicious meals.\nStrength\nMarge also occasionally displays superhuman strength. She has been seen lifting Homer off the ground\neasily several times, including picking him up and throwing him through the bedroom door to show him\nthat Moe taught her the bum's rush and swinging him around in a circle during a dance"}
{"filename": "Marge-Simpson", "question": "What does Marge do?", "start_in_document": 111, "answer_text": "homemaker and matriarch", "start_in_context": 111, "answer_correct": true, "feedback_type": "qa", "context": "Marjorie Jacqueline \"Marge\"\nSimpson\nMarge Simpson\nMarjorie Jacqueline \"Marge\" Simpson (née\nBouvier)[11] is the homemaker and matriarch of the\nSimpson family. She is also one of the five main\ncharacters in The Simpsons TV series. She and her\nhusband Homer have three children: Bart, Lisa, and\nMaggie. Marge is the moralistic force in her family and\noften provides a grounding voice in the midst of her\nfamily's antics by trying to maintain order in the Simpson\nhousehold. Aside from her duties at home, Marge has\nflirted briefly with a number of careers ranging from a\npolice officer to an anti-violence activist.\nBiography\nEarly life\nMarge Bouvier was born on in Capital City to Clancy\nBouvier, a photographer-turned-steward, and Jacqueline\nBouvier. She is the youngest daughter of the Bouvier\nfamily. She has a pair of older sisters, the joyless twins,\nPatty and Selma, both of whom passionately disapprove\nof Homer.\nTitles and Styles\nH.S.H/Her Serene Highness, the Princess Consort of Springfield, Duchess of Bouvier and Countess of\nSimpson.\nMeeting Homer\nMarge attended Springfield High School and in her senior year, she met Homer Simpson. She was wary\nof Homer at first but agreed to have a study date with him, only to find out that Homer was only doing\nthis to get her to go to prom with him. She ended up going with Artie Ziff. She regrets going with Artie\nbecause he tried to have sex with her afterward. Artie takes her home and she later picks up Homer,\nwho she finds walking home, in her car. Marge tells him how much she regretted going to the prom with\nArtie instead of him, causing Homer to somewhat repair the strap of her dress with the corsage he got\nher. After that decision, her sisters showed their discontent towards him and ultimately thinks he was just\nwrong for her. However, Selma does show that she is willing to make a sincere attempt to like Homer for\nMarge's"}
{"filename": "Selma-Bouvier", "question": "Why is the hair of Patty and Selma grey", "start_in_document": 9348, "answer_text": "The gray coloring is from cigarette ashes", "start_in_context": 569, "answer_correct": true, "feedback_type": "qa", "context": "sort of evil\", having raised them her entire lifetime.\nPatty and Selma also rarely shave their legs for some reason, although this isn’t always shown, given that both\ntwins wear dresses that expose their (hairless) legs. Also, they have been shown in swimsuits without leg hair.\nIn Tapped Out, Selma is only hairy above shin level, although it’s normal for females to have hairy thighs.\nSelma alongside her sister Patty is also implied to be somewhat lewd, as they were implied to have raped a\nTV repairman by faking it being broken,[9] had to register for sex offender registration once,[10] and once even\nrode a horse naked throughout Springfield a'la Godiva during the first-annual (and only) Do What You Feel\nPhysical Appearance\nShe is tall and overweight with a similar body type to Patty. She wears a blue sleeveless dress and round\nearrings. Her hair is long and curly, worn in an m-shape (although she wore different hairstyles when she was\nyounger, it’s always been longer than Patty’s). She is actually a blonde, in contrast to Patty's red hair, meaning\fthat they are in fact fraternal twins. The gray coloring is from cigarette ashes. On special occasions, Selma will\nwear earrings in the form of the letter \"S\", further distinguishing her from her twin, who wears triangle\nA running joke is that Selma was physically ugly, such as when helping her sister Patty teach an adult\neducation course for single women on how to land men by wearing tight revealing clothes, the female students\nwere left disgusted at Selma's appearance. Similarly, her attempt at a dating video resulted in her being\nrejected by even the likes of Groundskeeper Willie, himself not above sexually lewd elements, where he said\n\"back to the Loch with ye, Nessie!\" before turning off the video; and her accidentally sunbathing topless thanks\nto Bart using a falcon to steal her top prompted a presumed Beach proprietor to"}
{"filename": "Marge-Simpson", "question": "Does Marge smoke?", "start_in_document": 3578, "answer_text": "Although not a chain smoker like her eldest sisters Patty and Selma, Marge has\nengaged in smoking twice.", "start_in_context": 1095, "answer_correct": true, "feedback_type": "qa", "context": "certain things. The magician, Diablo, finds this annoying\nand pulls out a ball gag and while Marge is blabbering shoves it into her mouth so her drunken talk\nbecomes muffled sounds. This could also link to Marge's famous voice which throughout the Simpsons\nhas been considered annoying.\nMarge continues to make muffled sounds from her gagged mouth while a sack is put over her head\nduring the magic trick.\nMarriage\nAfter the two had been dating for several years, Marge became pregnant with Bart sometime in the\nsummer, and Marge and Homer got married on November 15, 1978 in a small wedding chapel near the\nstate line shortly before.\nMarried life\nMarge is the mother Simpson family, who spends most of her time doing housework, caring for Maggie,\nbeing supportive of and indulging Lisa, and either disciplining or protecting Bart from Homer's wrath.\nMarge is the only member of the family who encourages church attendance. She also appears to have a\nsignificant athletic ability. She is bilingual, being fully fluent in French. Her marriage to Homer is also very\nstrong. They once spurned to participate in a key party as soon as they realized what a key party was\nand promptly left, although Homer also took the key jar with them, most likely to find his car keys.\nWild Escapades\nDespite these tendencies, Marge has had her fair share of wild escapades throughout the history of the\nseries. She worked as a police officer in Springfield,[12] took therapy for flight fear,[13]was a real estate\nagent, sold pretzels, was a painter, was imprisoned for shoplifting,[14] became a gambling addict,[15]\nshowed alcoholic tendencies,[16]was at one time known as The Listen Lady, was an unwilling participant\nin a cross-country police chase,[17] overdosed on steroids,[18] cheated on a cooking competition[19] and\ndeveloped amnesia.[20] Although not a chain smoker like her eldest sisters Patty and Selma, Marge has\nengaged in smoking twice. One"}
{"filename": "Marge-Simpson.pdf", "question": "How long is the hair of Marge", "start_in_document": 10895, "answer_text": "waist-length", "start_in_context": 21, "answer_correct": true, "feedback_type": "annotation", "context": "As a teen, Marge had waist-length hair that she always wore down, but wore it in her trademark beehive"}
{"filename": "Patty-Bouvier", "question": "Do Patty and Selma like Homer?", "start_in_document": 11609, "answer_text": "Unlike Selma, who on rare occasions is nice to Homer, Patty hates him totally", "start_in_context": 537, "answer_correct": true, "feedback_type": "qa", "context": "having lost him.\" This gift, as well as the fact that they been saving for this\nsince Marge's wedding, causes her to angrily throw them out. The twins then use the tombstone as a\nOnce, when Homer had to apply for a chauffeur’s license to become a chauffeur so he could pay off a\ndebt he owed them, they purposely failed him to show how much of a loser he was. On this occasion,\nhowever, Homer had the last laugh; saving their jobs by pretending their cigarettes were his when they\nwere caught smoking on the job by their superior. Homer then forced them to wipe the debt clean to\nrepay the favor, thus negating his need to earn a chauffeur's license and removing the power they had of\nUnlike Selma, who on rare occasions is nice to Homer, Patty hates him totally; even when she saw how\ndevastated Marge was when Homer left her to find a better job, she still refused to help them get back\ntogether. [29] The kids also seem to defend their father from Patty and Selma's taunting and insults. For\nexample, when Patty states to Lisa she was just \"Trashing her father\" Lisa sticks up for Homer but Patty\ndid not seem to care what Lisa had to say.\fPatty's favorite brand of cigarettes is identified as \"Lady Laramie 100s\", and her habit had started\n\"before they were even born\". The sisters share an apartment at the Spinster Arms Apartments and work\nat the Department of Motor Vehicles (DMV). Patty and Selma both smoke in bed and have caused the\nSpinster Arms Apartments to catch on fire three times. Seen in \"Bart Gets Famous\". They have, on\noccasion, acted unprofessionally in the course of their jobs, usually when Homer is involved. They\nallowed Otto to regain his driver's license during Otto's brief tenancy with the Simpson family due to their\nmutual dislike for Homer.[30]\nPatty is shown on several occasions to be a severe"}
{"filename": "Selma-Bouvier", "question": "Do Patty and Selma like Homer?", "start_in_document": 5604, "answer_text": "Patty and Selma do not have hesitation in treating Homer with\nopen rudeness and contempt", "start_in_context": 538, "answer_correct": true, "feedback_type": "qa", "context": "Selma has gone through menopause and the twins are shown\nas preteens or teenagers when Marge is around Lisa’s age. She enjoys getting foot massages as she is\nshown getting them constantly. She weighs 168 pounds exact [6] and is considered overweight like Patty,\nthough they are not as fat as Homer. As teenagers and children, they are average weight, while Homer was\nstill fat.\nUnlike Homer, who usually makes a perfunctory (if not particularly sincere or committed) effort to be polite to\nhis sisters-in-law out of respect for his wife, Patty and Selma do not have hesitation in treating Homer with\nopen rudeness and contempt. There were several instances where they did not seem to care when Homer\nfaced a life-threatening situation. For instance, when Marge rushes to the hospital after receiving a telephone\ncall that Homer had suffered a heart attack at work, Patty and Selma — instead of going to the hospital and\ncomforting Marge in her time of need — remained seated at the kitchen table, continuing their activity of\ncutting coupons, gasping in amazement at a five cent discount and behaving as though nothing was wrong[7].\fThey later attempted to set up Marge with a (rather sleazy) man as a replacement for Homer, regardless of the\nfact that Homer was still very much alive.\nWhen Homer faked his demise to get out of work, Patty and Selma showed up at the Simpsons house holding\na tombstone inscribed with \"Homer J. Simpson. We are richer for having lost him.\" This gift as well as the fact\nthat they been saving this since Marge's wedding causes her to throw them out [8]. When Homer was revealed\nto be alive, the twins use the tombstone as a coffee table. It should also be noted that in the beginning of the\nseries, Patty and Selma's catchphrase was, \"Marge, why did you ever marry him\"? And then listed one single\nreason why he is a terrifying husband. In a 1997 Treehouse"}
{"filename": "Homer-Simpson", "question": " Homer's main beer supplier?", "start_in_document": 950, "answer_text": "Lenny Leonard,\nand Moe Szyslak", "start_in_context": 950, "answer_correct": false, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson.pdf", "question": "Homer's main beer supplier?", "start_in_document": 44830, "answer_text": "Moe is the owner of Moe's Tavern and is Homer's main supply of beer", "start_in_context": 0, "answer_correct": true, "feedback_type": "annotation", "context": "Moe is the owner of Moe's Tavern and is Homer's main supply of beer, making him a very important"}
{"filename": "Homer-Simpson", "question": "Homer's birth date", "start_in_document": 56, "answer_text": "May 12, 1950", "start_in_context": 56, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": "What did Homer do with the crayons?", "start_in_document": 24191, "answer_text": "When he had\nshoved all of them up his nasal passage, he sneezed the crayons out", "start_in_context": 817, "answer_correct": true, "feedback_type": "qa", "context": "the local driving range, office supplies (including computers) from work, and beer mugs\nfrom Moe's Tavern.\nHomer has a vacuous mind, but he is still able to retain a great amount of knowledge about very specific\nsubjects. He often shows short bursts of astonishing insight, memory, creativity, and fluency with many\nlanguages! Homer is also extremely confident; no matter how little skill or knowledge he has about\nanything he tries to do; he has no doubt that he will be successful. However, his brief periods of\nintelligence are overshadowed by much longer and more consistent periods of ignorance, forgetfulness,\nand stupidity. Homer has a low IQ due to many factors. Some of which include: his alcohol problem,\nexposure to radioactive waste, repetitive cranial trauma, and the crayon lodged in the frontal lobe of his\nbrain. He also implied that he would have been at least a bit smarter and more athletic, if not by a\nsubstantial amount, if his father had tried to give him encouragement rather than beat him down.[64]\nAnother large factor of Homer's unintelligent is his inheritance of the \"Simpson Gene\" which causes all\nmale members of the Simpson family to become more and more unintelligent as they grow older. It is\nalso implied Homer repeated second grade,[71] most probably due to the Simpson Gene kicking in.\nBut what is probably the biggest cause of his simple-mindedness was an incident that happened when\nhe was six years old and goofing around by shoving a 16 pack of crayons up his nose. When he had\nshoved all of them up his nasal passage, he sneezed the crayons out. Not all of them, however.\nUnbeknownst to him, one of the crayons got lodged in the right lobe of his brain. Homer would not learn\nthis fact until adulthood when he was forced to take a job as a human guinea pig to support his family\nwhere the crayon was found in a 3D x-ray of his brain (shortly after Dr."}
{"filename": "Bart-Simpson", "question": "What sport does Bart like?", "start_in_document": 4025, "answer_text": "skateboarding", "start_in_context": 1590, "answer_correct": true, "feedback_type": "qa", "context": "Lisa, playing video games, helping Lisa solve various problems (e.g.\nreuniting Krusty with his estranged Father), and pulling off various pranks, (such as mooning\nunsuspecting people, prank calling Moe at his tavern, and his patented spitting off an overpass). Bart\nalso sprays graffiti under the alias 'El Barto', and regularly frequents the Kwik-E-Mart (for bubble gum\nand Squishees) and The Android's Dungeon. Yuma Hickman moved to Springfield when Marge was\npregnant with Bart.\nBart hinted that his favorite movies are Jaws and the Star Wars trilogy.[13] His best friend is Milhouse Van\nHouten.\nDate of birth inconsistency\nIn \"My Sister, My Sitter”, it is stated that Lisa is 2 years and 38 days younger than Bart. In \"Mr. Lisa's\nOpus\" and on the show's official Instagram account, Lisa's birthday is revealed to be on May 9, putting\nBart's birthday on April 1. However, in \"Simpsorama\", Bart states that his birthday is on February 23rd.\nBehavior\nBart is a kindhearted, loyal and energetic, but sometimes very rowdy and mischievous boy.\nBart is a notorious prankster at Springfield Elementary, and his pranks are often elaborately complex, but\ncan lead to unfortunate consequences. Bart's overall intelligence, like his mother's, has been shown to\nfluctuate slightly over the course of the series. It has been shown anywhere from being just above his\nfather's level, to being just below, or (on the rare occasion that he shows interest or is willing to pay\nattention) exceeding that of his sister. Despite his behavior, Bart is also extremely good at science, art\nand even sports like skateboarding. His actions and speech frequently show considerable mental agility,\nstreet-smarts, and understanding. When Bart became a hall monitor for Springfield Elementary, his\ngrades went up, showing that he only struggles because he does not pay any attention.[14] Bart has\nADHD.["}
{"filename": "Lisa-Simpson", "question": "On what does Lisa focus?", "start_in_document": 583, "answer_text": "She focuses on her goals and\nstrives to reach her potential", "start_in_context": 583, "answer_correct": true, "feedback_type": "qa", "context": "Lisa Marie Simpson\nLisa Simpson\nLisa Marie Simpson (born May 9, 1981)[9] is the elder\ndaughter and middle child of the Simpson family and one\nof the two tritagonists (along with Marge,) of The\nSimpsons. She was named after a train called Lil' Lisa on\nher parents' 1st anniversary; in \"Homer and Lisa\nExchange Cross Words\", she called herself Lisa Bouvier\nafter estranging herself from her father after he bet\nagainst her in a crossword tournament.\nLisa Simpson is a charismatic 8-year-old girl who exceeds\nthe standard achievement of the intelligence level of\nchildren her age. Not to everyone's surprise, she is also\nthe moral center of her family. In her upbringing, Lisa\nlacks parental involvement of Homer and Marge, which\nleads to hobbies such as playing saxophone and guitar,\nriding and caring for horses, and interest in advanced\nstudies. In school, Lisa's popularity is affected by those\nwho view her as a geeky overachiever, which leaves her\nwith only a few friends. She focuses on her goals and\nstrives to reach her potential, and at the age of eight, she\nis already a member of Mensa with an IQ of 159. Her lack of parental involvement also leads to her\nlashing out at those who she deems lower than her or even above her. She has extreme jealousy from\ntime to time and will do whatever it takes to reclaim her title as the smartest; but only if she deems it\nnecessary. Otherwise, she's the intelligent and rational one who usually thinks things through.\nBiography\nLisa is quite eclectic in her knowledge and is notably more concerned with world affairs and problems\nthan her cohorts, which has led her to alienate herself from her peers. Lisa also deeply values her\nintegrity, sometimes at the expense of others' needs and happiness, as demonstrated when she cheats\non a test in The Wind in the Willows to attain her highest grade of A-plus, but later admits her dishonesty\nto an unreceptive Principal Skinner despite"}
{"filename": "Lisa-Simpson", "question": "Who is a member of Mensa?", "start_in_document": 448, "answer_text": "Lisa Simpson", "start_in_context": 448, "answer_correct": true, "feedback_type": "qa", "context": "Lisa Marie Simpson\nLisa Simpson\nLisa Marie Simpson (born May 9, 1981)[9] is the elder\ndaughter and middle child of the Simpson family and one\nof the two tritagonists (along with Marge,) of The\nSimpsons. She was named after a train called Lil' Lisa on\nher parents' 1st anniversary; in \"Homer and Lisa\nExchange Cross Words\", she called herself Lisa Bouvier\nafter estranging herself from her father after he bet\nagainst her in a crossword tournament.\nLisa Simpson is a charismatic 8-year-old girl who exceeds\nthe standard achievement of the intelligence level of\nchildren her age. Not to everyone's surprise, she is also\nthe moral center of her family. In her upbringing, Lisa\nlacks parental involvement of Homer and Marge, which\nleads to hobbies such as playing saxophone and guitar,\nriding and caring for horses, and interest in advanced\nstudies. In school, Lisa's popularity is affected by those\nwho view her as a geeky overachiever, which leaves her\nwith only a few friends. She focuses on her goals and\nstrives to reach her potential, and at the age of eight, she\nis already a member of Mensa with an IQ of 159. Her lack of parental involvement also leads to her\nlashing out at those who she deems lower than her or even above her. She has extreme jealousy from\ntime to time and will do whatever it takes to reclaim her title as the smartest; but only if she deems it\nnecessary. Otherwise, she's the intelligent and rational one who usually thinks things through.\nBiography\nLisa is quite eclectic in her knowledge and is notably more concerned with world affairs and problems\nthan her cohorts, which has led her to alienate herself from her peers. Lisa also deeply values her\nintegrity, sometimes at the expense of others' needs and happiness, as demonstrated when she cheats\non a test in The Wind in the Willows to attain her highest grade of A-plus, but later admits her dishonesty\nto an unreceptive Principal Skinner despite"}
{"filename": "Bart-Simpson", "question": "Who is Milhouse to Bart?", "start_in_document": 2994, "answer_text": "His best friend", "start_in_context": 559, "answer_correct": true, "feedback_type": "qa", "context": "Lisa, playing video games, helping Lisa solve various problems (e.g.\nreuniting Krusty with his estranged Father), and pulling off various pranks, (such as mooning\nunsuspecting people, prank calling Moe at his tavern, and his patented spitting off an overpass). Bart\nalso sprays graffiti under the alias 'El Barto', and regularly frequents the Kwik-E-Mart (for bubble gum\nand Squishees) and The Android's Dungeon. Yuma Hickman moved to Springfield when Marge was\npregnant with Bart.\nBart hinted that his favorite movies are Jaws and the Star Wars trilogy.[13] His best friend is Milhouse Van\nHouten.\nDate of birth inconsistency\nIn \"My Sister, My Sitter”, it is stated that Lisa is 2 years and 38 days younger than Bart. In \"Mr. Lisa's\nOpus\" and on the show's official Instagram account, Lisa's birthday is revealed to be on May 9, putting\nBart's birthday on April 1. However, in \"Simpsorama\", Bart states that his birthday is on February 23rd.\nBehavior\nBart is a kindhearted, loyal and energetic, but sometimes very rowdy and mischievous boy.\nBart is a notorious prankster at Springfield Elementary, and his pranks are often elaborately complex, but\ncan lead to unfortunate consequences. Bart's overall intelligence, like his mother's, has been shown to\nfluctuate slightly over the course of the series. It has been shown anywhere from being just above his\nfather's level, to being just below, or (on the rare occasion that he shows interest or is willing to pay\nattention) exceeding that of his sister. Despite his behavior, Bart is also extremely good at science, art\nand even sports like skateboarding. His actions and speech frequently show considerable mental agility,\nstreet-smarts, and understanding. When Bart became a hall monitor for Springfield Elementary, his\ngrades went up, showing that he only struggles because he does not pay any attention.[14] Bart has\nADHD.["}
{"filename": "Homer-Simpson", "question": " Who's middle name is Jay?", "start_in_document": 32, "answer_text": "Homer Jay Simpson", "start_in_context": 32, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Bart-Simpson", "question": " Who is JoJo?", "start_in_document": 26, "answer_text": "Bartholomew JoJo \"Bart\" Simpson", "start_in_context": 26, "answer_correct": true, "feedback_type": "qa", "context": "Bart Simpson\nBart Simpson\nBartholomew JoJo \"Bart\" Simpson (born April 1,\n1979)[7]is the mischievous, rebellious, misunderstood,\ndisruptive and \"potentially dangerous\" oldest child of the\nSimpson family in The Simpsons. He is the only son of\nHomer and Marge Simpson, and the older brother of Lisa\nand Maggie. He also has been nicknamed \"Cosmo\", after\ndiscovering a comet in \"Bart's Comet\". Bart has also been\non the cover on numerous comics, such as \"Critical Hit\",\n\"Simpsons Treasure Trove #11\", and \"Winter Wingding\".\nBart also has a 100-issue comic series entitled the\nSimpson Comics Presents Bart Simpson. Bart is loosely\nbased on Matt Groening and his older brother, Mark\nGroening.\nEven at a young age, Bart has accomplished many feats.\nHe has won an award for his Angry Dad web series[8], he\nhas discovered a new comet which was named after\nhim[9], and he also has performed in a successful band\nwith Milhouse Van Houten, Nelson Muntz, and Ralph Wiggum.[10]\nDescription\n“Bart is the dangerous eldest child of Homer and Marge. He is sometimes called El Barto.”\nBiography\nBart is a self-proclaimed underachiever and prankster who is constantly in detention, and, in addition to\nhis behavior, is easily distracted. He is the most misunderstood of the family (after Maggie, who currently\ncan only speak a few words), constantly frustrated by the narrow-minded people of Springfield, who\njudge him merely by his thoughts and actions.\nHis penchant for shocking people began before he was born, Bart \"mooned\" Dr. Hibbert while he\nperformed a sonogram on Marge when she was pregnant with him, and moments after being born, he\nset Homer's tie-on fire, starting his life as a prankster (although Marge claimed that he could not have\fdone it on purpose because he was only ten minutes old)[11]. Bart's first words were \"Ay Caramba\"[12"}
{"filename": "Bart-Simpson", "question": " Whose nickname is Cosmo?", "start_in_document": 13, "answer_text": "Bart Simpson", "start_in_context": 13, "answer_correct": true, "feedback_type": "qa", "context": "Bart Simpson\nBart Simpson\nBartholomew JoJo \"Bart\" Simpson (born April 1,\n1979)[7]is the mischievous, rebellious, misunderstood,\ndisruptive and \"potentially dangerous\" oldest child of the\nSimpson family in The Simpsons. He is the only son of\nHomer and Marge Simpson, and the older brother of Lisa\nand Maggie. He also has been nicknamed \"Cosmo\", after\ndiscovering a comet in \"Bart's Comet\". Bart has also been\non the cover on numerous comics, such as \"Critical Hit\",\n\"Simpsons Treasure Trove #11\", and \"Winter Wingding\".\nBart also has a 100-issue comic series entitled the\nSimpson Comics Presents Bart Simpson. Bart is loosely\nbased on Matt Groening and his older brother, Mark\nGroening.\nEven at a young age, Bart has accomplished many feats.\nHe has won an award for his Angry Dad web series[8], he\nhas discovered a new comet which was named after\nhim[9], and he also has performed in a successful band\nwith Milhouse Van Houten, Nelson Muntz, and Ralph Wiggum.[10]\nDescription\n“Bart is the dangerous eldest child of Homer and Marge. He is sometimes called El Barto.”\nBiography\nBart is a self-proclaimed underachiever and prankster who is constantly in detention, and, in addition to\nhis behavior, is easily distracted. He is the most misunderstood of the family (after Maggie, who currently\ncan only speak a few words), constantly frustrated by the narrow-minded people of Springfield, who\njudge him merely by his thoughts and actions.\nHis penchant for shocking people began before he was born, Bart \"mooned\" Dr. Hibbert while he\nperformed a sonogram on Marge when she was pregnant with him, and moments after being born, he\nset Homer's tie-on fire, starting his life as a prankster (although Marge claimed that he could not have\fdone it on purpose because he was only ten minutes old)[11]. Bart's first words were \"Ay Caramba\"[12"}
{"filename": "Homer-Simpson", "question": " in which year was homer simpsons born", "start_in_document": 64, "answer_text": "1950", "start_in_context": 64, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Lisa-Simpson", "question": " what are the best friends of lisa", "start_in_document": 12223, "answer_text": "Nelson Muntz, Ralph\nWiggum and Colin", "start_in_context": 574, "answer_correct": true, "feedback_type": "qa", "context": "popularity is generally purposeful yet her lack of social skills and different\nhobbies to what is considered fun to the rest of the girls leads her to want more friends. On one example\nshe changed her personality to fit a more rebellious nature like Bart and actually gained an entourage of\nfriends at the Flanders beach house but when her true academic nature was revealed, they continued to\nbefriend her due to viewing her as a kind, gentle person rather than just a nerd. Lisa has had a few\nboyfriends, though all of them were brief, despite her status as a geek such as Nelson Muntz, Ralph\nWiggum and Colin.\nExtremely nonathletic, she fails at sports completely, and her liberal stance and high intelligence gives\nher little bonding ground with her peers and Homer who is also passionate about sports and connects\nwith Bart more for this reason. Lisa is so weak that she could barely through a piece of paper into a\nrubbish can that was one away. However, she also displayed an uncharacteristic level of hand-eye\ncoordination when she caught an incoming hockey puck from Apu and proved herself to be an extreme\fhockey player when she was a goalie. This non-athleticness is further shown when she joins a ballet\nteam where the other members of the team have a smoking addiction. Initially, Lisa denounces them\nclaiming to not be allowed to smoke. She then begins to inhale the second-hand smoke, before\neventually becoming addicted to cigarettes. The episode ends with her addicted to nicotine. Even\nshowing her nicotine patches in the last few seconds. This implies that she never actually got help with\nher addiction and continues to be an addict. However, most likely, as it is never further mentioned, that\nshe is still addicted. The nicotine patches were never shown again.\nSimilar to Bart, Lisa's high academic intelligence and her desire to go far in life is greatly driven by her\nfuture goals. Bart never focused on his book work as he and basically everyone else knew that he would\namount to very"}
{"filename": "Bart-Simpson", "question": " does bart has a girlfriend", "start_in_document": 18978, "answer_text": "Bart has had many relationships with girls", "start_in_context": 1105, "answer_correct": true, "feedback_type": "qa", "context": ": One of Bart's worst crimes to date, he committed an act of treason in \"Homer\nthe Father\"; in that episode, betrayed his own country by selling out secrets from the Springfield\nNuclear Power Plant and almost gave it to Chinese agents, all for a Minibike. However out of\nremorse, he managed to get the USB drive back and swallowed it, much to the dismay of the\nChinese agents.\nGrand Theft Auto: Bart stole Chalmers' car after it was revealed he hid his keys in the sun visor.\nPeeping: While done out of the kindness of his heart after seeing his sister Lisa be insulted by Ms.\nCantwell, in \"Black-Eyed, Please\", he managed to sneak into the female bathroom and take a\nvideo of her insulting Lisa.\nIndirect Murder: in \"Replaceable You\" he was partially responsible (albeit unintentionally and\nunknowingly) for the death of Alice Glick when the \"Robopets\" he co-invented went rogue at the\nSpringfield Retirement Castle.\nJoyriding: In \"The Parent Rap\", Bart and Milhouse accidentally released the parking brake after\nbreaking into Wiggum's Police car and drove through an award ceremony in a park.\fSexuality\nBart has had many relationships with girls and in the future marries and divorces Jenda. However, he\nhas also been hinted as being attracted to boys. In \"Bart’s Friend Falls in Love\", Milhouse is smitten with\na transfer student named Samantha Stankey; Bart schemes not to steal the girl but to detonate the affair\nso he can have Milhouse back. Whatever discomfort Bart evinces at Milhouse’s emotional attachment to\nhim takes the familiar, unsubtle form of denial. And when Bart does find friendship with another boy, it’s\nexpressly coded as romantic: \"The Haw-Hawed Couple\" of season 18 sees him growing close to class\nbully Nelson Muntz, only to wind up fearing the intensity of his devotion. In the end, Bart wistfully cradles\none of his denim vests — an allusion to Brokeback Mountain."}
{"filename": "Lisa-Simpson", "question": " who is the oldest daugther of the simpsons", "start_in_document": 32, "answer_text": "Lisa Marie Simpson", "start_in_context": 32, "answer_correct": true, "feedback_type": "qa", "context": "Lisa Marie Simpson\nLisa Simpson\nLisa Marie Simpson (born May 9, 1981)[9] is the elder\ndaughter and middle child of the Simpson family and one\nof the two tritagonists (along with Marge,) of The\nSimpsons. She was named after a train called Lil' Lisa on\nher parents' 1st anniversary; in \"Homer and Lisa\nExchange Cross Words\", she called herself Lisa Bouvier\nafter estranging herself from her father after he bet\nagainst her in a crossword tournament.\nLisa Simpson is a charismatic 8-year-old girl who exceeds\nthe standard achievement of the intelligence level of\nchildren her age. Not to everyone's surprise, she is also\nthe moral center of her family. In her upbringing, Lisa\nlacks parental involvement of Homer and Marge, which\nleads to hobbies such as playing saxophone and guitar,\nriding and caring for horses, and interest in advanced\nstudies. In school, Lisa's popularity is affected by those\nwho view her as a geeky overachiever, which leaves her\nwith only a few friends. She focuses on her goals and\nstrives to reach her potential, and at the age of eight, she\nis already a member of Mensa with an IQ of 159. Her lack of parental involvement also leads to her\nlashing out at those who she deems lower than her or even above her. She has extreme jealousy from\ntime to time and will do whatever it takes to reclaim her title as the smartest; but only if she deems it\nnecessary. Otherwise, she's the intelligent and rational one who usually thinks things through.\nBiography\nLisa is quite eclectic in her knowledge and is notably more concerned with world affairs and problems\nthan her cohorts, which has led her to alienate herself from her peers. Lisa also deeply values her\nintegrity, sometimes at the expense of others' needs and happiness, as demonstrated when she cheats\non a test in The Wind in the Willows to attain her highest grade of A-plus, but later admits her dishonesty\nto an unreceptive Principal Skinner despite"}
{"filename": "Bart-Simpson", "question": " who is the oldest son of the simpsons", "start_in_document": 26, "answer_text": "Bartholomew JoJo \"Bart\" Simpson", "start_in_context": 26, "answer_correct": true, "feedback_type": "qa", "context": "Bart Simpson\nBart Simpson\nBartholomew JoJo \"Bart\" Simpson (born April 1,\n1979)[7]is the mischievous, rebellious, misunderstood,\ndisruptive and \"potentially dangerous\" oldest child of the\nSimpson family in The Simpsons. He is the only son of\nHomer and Marge Simpson, and the older brother of Lisa\nand Maggie. He also has been nicknamed \"Cosmo\", after\ndiscovering a comet in \"Bart's Comet\". Bart has also been\non the cover on numerous comics, such as \"Critical Hit\",\n\"Simpsons Treasure Trove #11\", and \"Winter Wingding\".\nBart also has a 100-issue comic series entitled the\nSimpson Comics Presents Bart Simpson. Bart is loosely\nbased on Matt Groening and his older brother, Mark\nGroening.\nEven at a young age, Bart has accomplished many feats.\nHe has won an award for his Angry Dad web series[8], he\nhas discovered a new comet which was named after\nhim[9], and he also has performed in a successful band\nwith Milhouse Van Houten, Nelson Muntz, and Ralph Wiggum.[10]\nDescription\n“Bart is the dangerous eldest child of Homer and Marge. He is sometimes called El Barto.”\nBiography\nBart is a self-proclaimed underachiever and prankster who is constantly in detention, and, in addition to\nhis behavior, is easily distracted. He is the most misunderstood of the family (after Maggie, who currently\ncan only speak a few words), constantly frustrated by the narrow-minded people of Springfield, who\njudge him merely by his thoughts and actions.\nHis penchant for shocking people began before he was born, Bart \"mooned\" Dr. Hibbert while he\nperformed a sonogram on Marge when she was pregnant with him, and moments after being born, he\nset Homer's tie-on fire, starting his life as a prankster (although Marge claimed that he could not have\fdone it on purpose because he was only ten minutes old)[11]. Bart's first words were \"Ay Caramba\"[12"}
{"filename": "Lisa-Simpson", "question": " what is the caracter of lisa", "start_in_document": 4451, "answer_text": "obsessing over getting a pony, being addicted to TV, and fighting with Bart", "start_in_context": 586, "answer_correct": true, "feedback_type": "qa", "context": "Lisa's first word was Bart at two years of age.\nDespite her high IQ, cuteness, and beauty, Lisa does have typical childhood issues, sometimes requiring\nadult intervention. She once tricked Homer into allowing her to ride the bus alone, only to become\nhopelessly lost. After his coworkers Lenny and Carl point out that he allowed his daughter to ride a bus\nby herself, Homer comes to her rescue.[13] Lisa has a Jewish imaginary friend named Rachel Cohen\nwho \"just got into Brandeis University.\" Even with a high intellect, Lisa displays personality traits typical\nfor her age, including obsessing over getting a pony, being addicted to TV, and fighting with Bart. Lisa\nonce got addicted to secondhand smoke to maintain an impressive level of ballet competence; Homer\ntries to prevent the addiction unsuccessfully, and in the end, Lisa overcomes the addiction herself\nthrough means of \"Hello Kitty\" nicotine patches.[14] She also displays a surprising amount of skill in\ndriving, especially for her age, sometimes even taking the wheel whenever Homer ended up distracted\nIn \"The Girl Who Slept Too Little\", she struggled with nightmares after a cemetery was moved next to the\nSimpsons' house. She overcame her fear after spending a night in the cemetery and realized that it was\nacceptable to suffer from fear despite her intelligence. It was revealed in this episode that Lisa largely\nhad to raise herself due to Homer and Marge dealing with Bart's antics thus ensuring a lack of nurturing\nfor her. Lisa has been known in earlier seasons to have a bit of a sassy attitude.\nLike Bart and most siblings in families, Lisa has been known to tease Bart herself, examples such as\ncrushes Bart has developed, or advice on writing to someone (in this one case, his teacher), even just\nplain sassing him for attention. Deep down inside, Lisa loves her brother deeply.\nAppearance\fLisa has yellow skin, blue eyes (although the pupils look like 2 black dots just like the other characters),\nand"}
{"filename": "Bart-Simpson", "question": " how does bart dress", "start_in_document": 20310, "answer_text": "blue shorts and blue sneakers with white socks", "start_in_context": 1179, "answer_correct": true, "feedback_type": "qa", "context": "\"Bart’s Friend Falls in Love\", Milhouse is smitten with\na transfer student named Samantha Stankey; Bart schemes not to steal the girl but to detonate the affair\nso he can have Milhouse back. Whatever discomfort Bart evinces at Milhouse’s emotional attachment to\nhim takes the familiar, unsubtle form of denial. And when Bart does find friendship with another boy, it’s\nexpressly coded as romantic: \"The Haw-Hawed Couple\" of season 18 sees him growing close to class\nbully Nelson Muntz, only to wind up fearing the intensity of his devotion. In the end, Bart wistfully cradles\none of his denim vests — an allusion to Brokeback Mountain.\nAppearance\nBart has yellow skin and blond spiky hair (naturally pale red as revealed in \"No Loan Again, Naturally\")\nthat matches the color of his skin (similar to his sisters - on one occasion, this caused distress in all\nthree of the siblings and had them wonder where their heads end and their hair actually starts), sports,\nand, like the other characters of The Simpsons, has blue eyes (although the pupils look like 2 black\ndots). He wears an vermillion shirt (salmon in \"Bart Gets an \"F\"\", blue short-sleeved shirt on early\nmerchandise), blue shorts and blue sneakers with white socks. He sometimes wears his \"lucky\" red\nbaseball cap and carries around his skateboard or a slingshot.\nIn his future appearances, his hair is usually longer, and he is shown to be slightly fat.\nAlter Egos and Aliases\nBart sprays graffiti around Springfield using the name \"El Barto\", and his superhero alter-ego is\n\"Bartman\". He called himself Cupcake Kid[26] when Homer became Pie Man. Bart is also known as \"The\nDevil in Blue Shorts\"[27] by the organizers of the Teacher of the Year Awards, but he was believed to be\nan urban legend.\nEl Barto\nEl Barto is what Bart calls himself. Principal Skinner considers El Barto the most wanted kid in the"}
{"filename": "Homer-Simpson", "question": " What's Homer's favorite color?", "start_in_document": 453, "answer_text": "blue", "start_in_context": 453, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": " What awards did Homer win?", "start_in_document": 1593, "answer_text": "Grammy, an Academy Award, a Pulitzer Prize", "start_in_context": 393, "answer_correct": true, "feedback_type": "qa", "context": "Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non the Simpson family farm until they were forced to move out due to Homer jumping out of a hay bale\nand scaring the cows into giving sour milk, causing the bank to foreclose it. At some point in his\nchildhood, Homer began drinking alcohol like his father and accidentally caused a traffic jam in a\nPlayskool car. According to a family tree designed by the creator of the show, Matt Groening, Mr. Burns,\nhis boss, is a distant relative of him.\nHis father forced him to attend Camp See-A-Tree, where he went on a date with Marge Bouvier from\nCamp Land-A-Man; unfortunately, he lied about his name and sustained an injury while Marge changed\nher appearance. Homer then accidentally stumbled into Camp Flab-Away and escaped too late to meet\nwith her again, something that left him as heartbroken as Marge.[43]\nWhen Homer was around twelve, his mother went into hiding following a run-in with the law and Abe\nfaked her death[44]; before that, she took Homer and Abe to Woodstock, where he ended up briefly\nadopting the hippie lifestyle, much to Abe's disapproval. Homer, along with Lenny, Carl, and Moe, went\nto a deep gorge to swim but the water was drained. When investigating why the lake was reduced to a"}
{"filename": "Lisa-Simpson", "question": " what is the skin color of the simpsons", "start_in_document": 5743, "answer_text": "yellow", "start_in_context": 528, "answer_correct": true, "feedback_type": "qa", "context": "in this episode that Lisa largely\nhad to raise herself due to Homer and Marge dealing with Bart's antics thus ensuring a lack of nurturing\nfor her. Lisa has been known in earlier seasons to have a bit of a sassy attitude.\nLike Bart and most siblings in families, Lisa has been known to tease Bart herself, examples such as\ncrushes Bart has developed, or advice on writing to someone (in this one case, his teacher), even just\nplain sassing him for attention. Deep down inside, Lisa loves her brother deeply.\nAppearance\fLisa has yellow skin, blue eyes (although the pupils look like 2 black dots just like the other characters),\nand a blonde “starfish\" hairstyle that is styled into points and matches the color of her skin. She doesn’t\nhave any visible hairline. She’s usually seen wearing a short, strapless vermillion dress with a zigzag\nhem, matching orange Mary-Jane shoes, and a white pearl necklace (given to her by Marge). She’s 4'2\"\nShe has had two different outfits for church and family outings: a magenta long-sleeved dress with a\nruffled collar and magenta pumps for church and a baby pink short-sleeved tutu dress with a darker pink\nbelt, dark pink collar, and pink Mary-Jane shoes; and she occasionally wears a matching wide-brimmed\nhat. At night, she dresses in a turquoise nightgown with a frilly white collar and matching cuffs, as well as\nturquoise slippers. When Lisa swims, she wears a magenta or red swimsuit.\nHer hair has been styled out of its star shape a few times, such as in \"The President Wore Pearls\", \"22\nShort Films About Springfield \", \"Teenage Mutant Milk-caused Hurdles \", and \"Last Traction Hero\". It is\nalso shown to be about chin or sometimes shoulder length. In future appearances as an adult and\nteenager, her hair \"points\" are usually worn in a styled-back fashion.\nLisa inherited her father"}
{"filename": "Bart-Simpson", "question": " what is the skin color of bart", "start_in_document": 19787, "answer_text": "yellow", "start_in_context": 656, "answer_correct": true, "feedback_type": "qa", "context": "\"Bart’s Friend Falls in Love\", Milhouse is smitten with\na transfer student named Samantha Stankey; Bart schemes not to steal the girl but to detonate the affair\nso he can have Milhouse back. Whatever discomfort Bart evinces at Milhouse’s emotional attachment to\nhim takes the familiar, unsubtle form of denial. And when Bart does find friendship with another boy, it’s\nexpressly coded as romantic: \"The Haw-Hawed Couple\" of season 18 sees him growing close to class\nbully Nelson Muntz, only to wind up fearing the intensity of his devotion. In the end, Bart wistfully cradles\none of his denim vests — an allusion to Brokeback Mountain.\nAppearance\nBart has yellow skin and blond spiky hair (naturally pale red as revealed in \"No Loan Again, Naturally\")\nthat matches the color of his skin (similar to his sisters - on one occasion, this caused distress in all\nthree of the siblings and had them wonder where their heads end and their hair actually starts), sports,\nand, like the other characters of The Simpsons, has blue eyes (although the pupils look like 2 black\ndots). He wears an vermillion shirt (salmon in \"Bart Gets an \"F\"\", blue short-sleeved shirt on early\nmerchandise), blue shorts and blue sneakers with white socks. He sometimes wears his \"lucky\" red\nbaseball cap and carries around his skateboard or a slingshot.\nIn his future appearances, his hair is usually longer, and he is shown to be slightly fat.\nAlter Egos and Aliases\nBart sprays graffiti around Springfield using the name \"El Barto\", and his superhero alter-ego is\n\"Bartman\". He called himself Cupcake Kid[26] when Homer became Pie Man. Bart is also known as \"The\nDevil in Blue Shorts\"[27] by the organizers of the Teacher of the Year Awards, but he was believed to be\nan urban legend.\nEl Barto\nEl Barto is what Bart calls himself. Principal Skinner considers El Barto the most wanted kid in the"}
{"filename": "Homer-Simpson", "question": " What does Homer simpson enjoy doing?", "start_in_document": 473, "answer_text": "dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding", "start_in_context": 473, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": " Who are the favorite kiddies of Homer Simpson?", "start_in_document": 616, "answer_text": "Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".", "start_in_context": 616, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": " What awards did Homer win?", "start_in_document": 1593, "answer_text": "Grammy, an Academy Award, a Pulitzer Prize", "start_in_context": 393, "answer_correct": true, "feedback_type": "qa", "context": "Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non the Simpson family farm until they were forced to move out due to Homer jumping out of a hay bale\nand scaring the cows into giving sour milk, causing the bank to foreclose it. At some point in his\nchildhood, Homer began drinking alcohol like his father and accidentally caused a traffic jam in a\nPlayskool car. According to a family tree designed by the creator of the show, Matt Groening, Mr. Burns,\nhis boss, is a distant relative of him.\nHis father forced him to attend Camp See-A-Tree, where he went on a date with Marge Bouvier from\nCamp Land-A-Man; unfortunately, he lied about his name and sustained an injury while Marge changed\nher appearance. Homer then accidentally stumbled into Camp Flab-Away and escaped too late to meet\nwith her again, something that left him as heartbroken as Marge.[43]\nWhen Homer was around twelve, his mother went into hiding following a run-in with the law and Abe\nfaked her death[44]; before that, she took Homer and Abe to Woodstock, where he ended up briefly\nadopting the hippie lifestyle, much to Abe's disapproval. Homer, along with Lenny, Carl, and Moe, went\nto a deep gorge to swim but the water was drained. When investigating why the lake was reduced to a"}
{"filename": "Lisa-Simpson", "question": " what is the iq of lisa", "start_in_document": 1109, "answer_text": "159", "start_in_context": 1109, "answer_correct": true, "feedback_type": "qa", "context": "Lisa Marie Simpson\nLisa Simpson\nLisa Marie Simpson (born May 9, 1981)[9] is the elder\ndaughter and middle child of the Simpson family and one\nof the two tritagonists (along with Marge,) of The\nSimpsons. She was named after a train called Lil' Lisa on\nher parents' 1st anniversary; in \"Homer and Lisa\nExchange Cross Words\", she called herself Lisa Bouvier\nafter estranging herself from her father after he bet\nagainst her in a crossword tournament.\nLisa Simpson is a charismatic 8-year-old girl who exceeds\nthe standard achievement of the intelligence level of\nchildren her age. Not to everyone's surprise, she is also\nthe moral center of her family. In her upbringing, Lisa\nlacks parental involvement of Homer and Marge, which\nleads to hobbies such as playing saxophone and guitar,\nriding and caring for horses, and interest in advanced\nstudies. In school, Lisa's popularity is affected by those\nwho view her as a geeky overachiever, which leaves her\nwith only a few friends. She focuses on her goals and\nstrives to reach her potential, and at the age of eight, she\nis already a member of Mensa with an IQ of 159. Her lack of parental involvement also leads to her\nlashing out at those who she deems lower than her or even above her. She has extreme jealousy from\ntime to time and will do whatever it takes to reclaim her title as the smartest; but only if she deems it\nnecessary. Otherwise, she's the intelligent and rational one who usually thinks things through.\nBiography\nLisa is quite eclectic in her knowledge and is notably more concerned with world affairs and problems\nthan her cohorts, which has led her to alienate herself from her peers. Lisa also deeply values her\nintegrity, sometimes at the expense of others' needs and happiness, as demonstrated when she cheats\non a test in The Wind in the Willows to attain her highest grade of A-plus, but later admits her dishonesty\nto an unreceptive Principal Skinner despite"}
{"filename": "Homer-Simpson", "question": " What's Homer Simpson's job?", "start_in_document": 706, "answer_text": "low-level safety inspector", "start_in_context": 706, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": " when was homer simpsons born", "start_in_document": 56, "answer_text": "May 12, 1950", "start_in_context": 56, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": " what does homer like eating", "start_in_document": 488, "answer_text": "\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding", "start_in_context": 488, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": " in which company is homer working", "start_in_document": 6751, "answer_text": "Springfield Nuclear Power Plant", "start_in_context": 603, "answer_correct": true, "feedback_type": "qa", "context": "to support his family.[51] Since then, Homer has started many jobs, but in the end, he always\ncomes back to his job at the Nuclear Plant.\nChildhood Summary\nHomer's childhood was a tragic one. His mother had to exile at a young age and his father never took\nnotice to Homer. This caused Homer to be very insecure about himself and underachieving things,\nthinking he lacked the skills to do so, which left him behind in almost everything and likely caused him to\nbe what he is today.\nJobs\nIn \"Homer Scissorhands\", he worked as a hairdresser, but then he got tired of it and returned to his old\njob at the Springfield Nuclear Power Plant.[52]\nIn \"Homer's Odyssey\", he worked at the Springfield Nuclear Power Plant as a technical supervisor. He\nwas fired by Barry Mackleberry (right in front of Bart), who was his supervisor, for creating a deadly gas\nleak. He was later rehired to safety inspector for Sector 7G, after complaining about the safety of the\nplant itself. Ironically, the accidents that occur at the plant have doubled every year since Homer was\nmade safety inspector.[53]\nHomer rarely attends his job, and yet seldom gets fired (and when he does get fired, he always ends up\nrehired somehow) and always has his job waiting when he plans to get rehired and has impulsively quit\noccasionally to pursue other careers, although he always ends up losing or quitting these jobs. On one\noccasion, Homer has misinterpreted a threat about losing his job as a hint that he can take the following\nday off.\nHomer also applied for a job as Santa, to make up for his missed Christmas bonus at the power plant.[54]\nCriminal Record\fHomer has committed a wide range of crimes and infractions, from ticket-worthy offenses to felonies.\nHe's spent little time in jail for his actions, but if he were to be found guilty of all the counts detailed\nbelow, he could find himself"}
{"filename": "Bart-Simpson", "question": " who are the sibblings of Bart?", "start_in_document": 27913, "answer_text": "Nelson Muntz, Lewis,\nRichard, Bashir bin Laden, Nikki McKenna, Jessica Lovejoy, Donny, Laura Powers", "start_in_context": 31, "answer_correct": false, "feedback_type": "qa", "context": "; Bart's other friends include Nelson Muntz, Lewis,\nRichard, Bashir bin Laden, Nikki McKenna, Jessica Lovejoy, Donny, Laura Powers and even the less\fsocially desirable children of his school, such as Ralph Wiggum, Martin Prince, Database, and Wendell\nBorton.\nMilhouse Van Houten\nOut of all of them, Bart's best friend is Milhouse Van Houten. Though the two are close friends, Bart has\naccidentally put Milhouse into trouble countless times throughout the series, with more than one\noccasion causing physical harm to Milhouse due to Bart's lack of regard for Milhouse's safety. At one\ntime, Bart was driving a forklift with Milhouse standing on the fork while the forklift was moving. When\nMarge stopped Bart from driving the forklift, Milhouse was sent flying and was knocked unconscious.\nThe relationship between Milhouse and Bart has been strained several times. When Milhouse fell in love\nwith Samantha Stankey and spent less time with his best buddy, Bart separated the two by notifying\nSamantha's father, who placed Samantha in a Catholic school. This resulted in a fight between the two\nfriends, although Bart eventually offered an apology. In one episode, Bart stated that he was a little\nattracted to Milhouse, to get Homer ticked off.\nNelson Muntz\nBart's relationship with fellow school ne'er-do-gooder Nelson Muntz is rather rocky, even in recent times.\nBart's first encounter with Nelson resulted in the bully recieving a bleeding nose in an act of self-defense;\nhowever, Nelson immediately took a dislike to Bart. An ensuing encounter resulted in Bart returning\nhome all trashed up and in a trash can. Bart eventually rallied the kids of Springfield to fight back against\nNelson and his cronies, which led to the bullies surrendering.\nWhile he has bullied Bart in the same way he has bullied the other kids, Nelson does respect him and is\nregularly seen in Bart's circle of friends; this turns a heel in \"The Haw-Hawed Couple"}
{"filename": "Bart-Simpson", "question": " what is the lastname of Bart?", "start_in_document": 50, "answer_text": "Simpson", "start_in_context": 50, "answer_correct": true, "feedback_type": "qa", "context": "Bart Simpson\nBart Simpson\nBartholomew JoJo \"Bart\" Simpson (born April 1,\n1979)[7]is the mischievous, rebellious, misunderstood,\ndisruptive and \"potentially dangerous\" oldest child of the\nSimpson family in The Simpsons. He is the only son of\nHomer and Marge Simpson, and the older brother of Lisa\nand Maggie. He also has been nicknamed \"Cosmo\", after\ndiscovering a comet in \"Bart's Comet\". Bart has also been\non the cover on numerous comics, such as \"Critical Hit\",\n\"Simpsons Treasure Trove #11\", and \"Winter Wingding\".\nBart also has a 100-issue comic series entitled the\nSimpson Comics Presents Bart Simpson. Bart is loosely\nbased on Matt Groening and his older brother, Mark\nGroening.\nEven at a young age, Bart has accomplished many feats.\nHe has won an award for his Angry Dad web series[8], he\nhas discovered a new comet which was named after\nhim[9], and he also has performed in a successful band\nwith Milhouse Van Houten, Nelson Muntz, and Ralph Wiggum.[10]\nDescription\n“Bart is the dangerous eldest child of Homer and Marge. He is sometimes called El Barto.”\nBiography\nBart is a self-proclaimed underachiever and prankster who is constantly in detention, and, in addition to\nhis behavior, is easily distracted. He is the most misunderstood of the family (after Maggie, who currently\ncan only speak a few words), constantly frustrated by the narrow-minded people of Springfield, who\njudge him merely by his thoughts and actions.\nHis penchant for shocking people began before he was born, Bart \"mooned\" Dr. Hibbert while he\nperformed a sonogram on Marge when she was pregnant with him, and moments after being born, he\nset Homer's tie-on fire, starting his life as a prankster (although Marge claimed that he could not have\fdone it on purpose because he was only ten minutes old)[11]. Bart's first words were \"Ay Caramba\"[12"}
{"filename": "Bart-Simpson", "question": " what is the family name of Bart?", "start_in_document": 50, "answer_text": "Simpson", "start_in_context": 50, "answer_correct": true, "feedback_type": "qa", "context": "Bart Simpson\nBart Simpson\nBartholomew JoJo \"Bart\" Simpson (born April 1,\n1979)[7]is the mischievous, rebellious, misunderstood,\ndisruptive and \"potentially dangerous\" oldest child of the\nSimpson family in The Simpsons. He is the only son of\nHomer and Marge Simpson, and the older brother of Lisa\nand Maggie. He also has been nicknamed \"Cosmo\", after\ndiscovering a comet in \"Bart's Comet\". Bart has also been\non the cover on numerous comics, such as \"Critical Hit\",\n\"Simpsons Treasure Trove #11\", and \"Winter Wingding\".\nBart also has a 100-issue comic series entitled the\nSimpson Comics Presents Bart Simpson. Bart is loosely\nbased on Matt Groening and his older brother, Mark\nGroening.\nEven at a young age, Bart has accomplished many feats.\nHe has won an award for his Angry Dad web series[8], he\nhas discovered a new comet which was named after\nhim[9], and he also has performed in a successful band\nwith Milhouse Van Houten, Nelson Muntz, and Ralph Wiggum.[10]\nDescription\n“Bart is the dangerous eldest child of Homer and Marge. He is sometimes called El Barto.”\nBiography\nBart is a self-proclaimed underachiever and prankster who is constantly in detention, and, in addition to\nhis behavior, is easily distracted. He is the most misunderstood of the family (after Maggie, who currently\ncan only speak a few words), constantly frustrated by the narrow-minded people of Springfield, who\njudge him merely by his thoughts and actions.\nHis penchant for shocking people began before he was born, Bart \"mooned\" Dr. Hibbert while he\nperformed a sonogram on Marge when she was pregnant with him, and moments after being born, he\nset Homer's tie-on fire, starting his life as a prankster (although Marge claimed that he could not have\fdone it on purpose because he was only ten minutes old)[11]. Bart's first words were \"Ay Caramba\"[12"}
{"filename": "Marge-Simpson", "question": " who is marge simpsons ", "start_in_document": 111, "answer_text": "homemaker and matriarch of the\nSimpson family", "start_in_context": 111, "answer_correct": true, "feedback_type": "qa", "context": "Marjorie Jacqueline \"Marge\"\nSimpson\nMarge Simpson\nMarjorie Jacqueline \"Marge\" Simpson (née\nBouvier)[11] is the homemaker and matriarch of the\nSimpson family. She is also one of the five main\ncharacters in The Simpsons TV series. She and her\nhusband Homer have three children: Bart, Lisa, and\nMaggie. Marge is the moralistic force in her family and\noften provides a grounding voice in the midst of her\nfamily's antics by trying to maintain order in the Simpson\nhousehold. Aside from her duties at home, Marge has\nflirted briefly with a number of careers ranging from a\npolice officer to an anti-violence activist.\nBiography\nEarly life\nMarge Bouvier was born on in Capital City to Clancy\nBouvier, a photographer-turned-steward, and Jacqueline\nBouvier. She is the youngest daughter of the Bouvier\nfamily. She has a pair of older sisters, the joyless twins,\nPatty and Selma, both of whom passionately disapprove\nof Homer.\nTitles and Styles\nH.S.H/Her Serene Highness, the Princess Consort of Springfield, Duchess of Bouvier and Countess of\nSimpson.\nMeeting Homer\nMarge attended Springfield High School and in her senior year, she met Homer Simpson. She was wary\nof Homer at first but agreed to have a study date with him, only to find out that Homer was only doing\nthis to get her to go to prom with him. She ended up going with Artie Ziff. She regrets going with Artie\nbecause he tried to have sex with her afterward. Artie takes her home and she later picks up Homer,\nwho she finds walking home, in her car. Marge tells him how much she regretted going to the prom with\nArtie instead of him, causing Homer to somewhat repair the strap of her dress with the corsage he got\nher. After that decision, her sisters showed their discontent towards him and ultimately thinks he was just\nwrong for her. However, Selma does show that she is willing to make a sincere attempt to like Homer for\nMarge's"}
{"filename": "Homer-Simpson", "question": " who is homer simpsons", "start_in_document": 107, "answer_text": "the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson", "start_in_context": 107, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": " from which city is homer simpsons", "start_in_document": 88, "answer_text": "Springfield", "start_in_context": 88, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": " where does homer simpsons goes drinking", "start_in_document": 13830, "answer_text": "Moe's Tavern", "start_in_context": 514, "answer_correct": true, "feedback_type": "qa", "context": ". In \"Wild Barts\nCan't Be Broken\", he made ageist comments against children and the elderly. In \"Mypods and\nBoomsticks\", he made Islamophobic comments against Bashir bin Laden's family.\nCannibalism: In \"Treehouse of Horror XXVIII\", he ate himself and he also ate several people as a\nblob in \"Treehouse of Horror XVII\".\nAttempting to smuggle a panda: In \"Goo Goo Gai Pan\", Homer attempted to smuggle a giant\npanda cub from Beijing, China.\nDrink Driving: Homer has drove drunk numerous times, usually after visiting Moe's Tavern.\nPiracy: In \"Steal This Episode\", Homer started an outdoor cinema screening pirated movie, with\nno ads. The FBI arrested him after Marge told them about Homer's illegal cinema, however he\nescaped them. The Simpson family then sought asylum at the Consulate of Sweden in Springfield.\nAppearance\fHomer's appearance is that of an overweight balding man. Despite his overweight status, and hate for\nexercise, he has on occasion shown surprising physical prowess and agility for a man of his body type,\nsuch as when training for Whacking Day and he hits several pop-up Snakes with kicks and even back-\nflipping. His baldness is contributed by several factors, such as upon finding out whenever Marge was\npregnant, he would tear out a substantial amount of his hair. Another contribution is working at the\nnuclear plant for so many years that the exposure to radioactivity has caused most of his hair to fall out.\nAnother frequent topic on Homer's obesity is his large posterior which is often joked about by Bart. His\neyes are blue, and he is 6 feet tall (183 cm) (https://imgur.com/a/1GSaw7y).[55] While his weight is\ndebatable, the most common weight given is 239 pounds (though many jokes about his weight would\nsuggest he is much heavier). He wears a white polo shirt, blue jeans, white underpants, and gray\nloafers.\nPersonality\nHomer is a pure"}
{"filename": "Homer-Simpson", "question": " what is homer often drinking", "start_in_document": 1093, "answer_text": "Duff", "start_in_context": 1093, "answer_correct": true, "feedback_type": "qa", "context": "Homer Jay Simpson\nHomer Simpson\nHomer Jay Simpson (born May 12, 1950)[40] is a man\nfrom Springfield. He is the spouse of Marge Simpson and\nfather of Bart, Lisa and Maggie Simpson. Homer is\noverweight (said to be 313.1 pounds)[41], lazy, and often\nignorant to the world around him. Although he has many\nflaws, he has shown to have great caring, love, and even\nbravery to those he cares about and, sometimes, even\nothers he doesn't.\nHis favorite color is blue, and he enjoys dancing, eating\ndonuts, drinking, hugging, driving a sit-down arcade racer,\nplaying the piano and horse riding. His favorite kiddie\nrides are \"Stuart Little\", \"Barney Train\" and \"Ride the\nChampion Mechanical Horse\".\nHomer works as a low-level safety inspector at the\nSpringfield Nuclear Power Plant in Sector 7G, although\nhe is often incompetent and negligent towards his duties.\nHe spends a great deal of his time at Moe's Tavern with\nhis friends Barney Gumble, Carl Carlson, Lenny Leonard,\nand Moe Szyslak. At home, he can often be found sitting\non the couch mindlessly watching TV while snacking on\nfood and drinking Duff. Homer is also the only son of\nAbraham Simpson II and Mona Simpson. When\nprovoked, he often strangles Bart for pressuring him. Even though he mutually hates his wife's sisters\nPatty and Selma Bouvier, he played Selma's husband for her to adopt Ling and agreed to be the minister\nfor Patty's intended homosexual marriage. As a result of this, Homer is her legal adoptive father.[42]\nHomer may just be a normal man, but he has had many great achievements and experiences in his life.\nHe has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many\ntimes.\nBiography\fHomer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised\non"}
{"filename": "Homer-Simpson", "question": " what is homer often drinking", "start_in_document": 8341, "answer_text": "malt liquor", "start_in_context": 959, "answer_correct": true, "feedback_type": "qa", "context": "when he plans to get rehired and has impulsively quit\noccasionally to pursue other careers, although he always ends up losing or quitting these jobs. On one\noccasion, Homer has misinterpreted a threat about losing his job as a hint that he can take the following\nday off.\nHomer also applied for a job as Santa, to make up for his missed Christmas bonus at the power plant.[54]\nCriminal Record\fHomer has committed a wide range of crimes and infractions, from ticket-worthy offenses to felonies.\nHe's spent little time in jail for his actions, but if he were to be found guilty of all the counts detailed\nbelow, he could find himself sentenced to life in jail plus 350 years and fined somewhere in the range of\n$120 million (and lose custody of his children, in the child abuse/neglect case). Here's a run-down of\nHomer’s crimes, along with some prime examples:\nAnimal cruelty: In \"Homer Goes to College\", Homer steals mascot Sir Oinks-A-Lot and makes it\ndrink malt liquor. In \"Girly Edition\", he allows a helper monkey to eat to exhaustion. In \"Marge\nSimpson in: \"Screaming Yellow Honkers\"\", he hits a lemur at the zoo with a slingshot, triggering\nrhinos to escape. In \"Kill the Alligator and Run\", he runs over and injures an alligator with an\nairboat. In \"She of Little Faith\", he shoots a hamster into the air in a model rocket. In \"The Frying\nGame\", he injures an endangered species, the Screamapillar. In \"Bonfire of the Manatees\", he\nsends a manatee to work as his replacement, causing it to dehydrate. In \"We're on the Road to\nD'oh-where\", he runs over a horse on the way to pick up Bart from camp; asks Bart to wipe the\nblood off the car before getting in. In \"Ice Cream of Margie (with the Light Blue Hair)\", he drives off-"}
