{"question": "Who is the wife of Homer Simpson", "context": "[95] Amber Amber was a waitress at a casino in Las Vegas and was Homer's Vegas wife. Homer accidentally married her when he and Ned Flanders got drunk. Ned married the other waitress at the casino named Ginger. Doing the only decent thing they could, they ran from them. [96]However, after a long time, the waitresses managed to track them to Springfield, and Amber went to live to the Simpsons house and revealed to Marge and the children about her marriage to Homer, which infuriated Marge to the point to she threw Homer out of the house, and later the family managed to get her drunk and made her marry Abe, which made her run back to Vegas. Amber died from a drug Julia When Homer becomes a famous Opera singer, he attracts the attention of horde of fans including a stalker by the name of Julia. She confesses to Homer that she is his to do with as he wants, becoming his personal assistant and attempting to seduce him at every turn. When he proclaims that his heart belongs to Marge she attempts to kill him with no success. [80] Wasted potential love interests Annie Crawford Annie was a FBI agent who was investigating Homer after Lisa said he could be a terrorist. What makes this interesting is that we know Homer does consider her attractive, and he even called her beautiful in her debut episode. It's implied in \"Homerland\" that she has romantic feelings for him, but nothing came from it since it was her first and so far only appearance. Friendships Moe Szyslak “I could never stay mad at you, Moe.", "feedback_type": "qa", "answer_start": 5, "answer_text": "Amber Amber", "confidence": 0.974547687872701, "answer_correct": false, "document_correct": false}
{"question": "Who is the wife of Homer Simpson", "context": "Once Homer and his family find out they are in a video game, they must go on a quest to find the creator of the game. Homer has powers in the game (see Homer's Powers) The Simpsons: Tapped Out Homer is a major character in The Simpsons: Tapped Out. After accidentally destroying Springfield, Homer must get the town back, and rebuild it with the help of the player. Family Guy \"PTV\" In the opening sequence in \"PTV\", Homer is being chased into his garage a la the opening sequence to The Simpsons, with Homer being flattened by Stewie's tricycle. Peter then opens the garage door, notices Homer unconscious, and asks Stewie who the man is. \"Movin' Out (Brian's Song)\" Homer is also heard from in \"Movin' Out (Brian's Song)\". He walks in on his wife Marge cheating on him with Glenn Quagmire. Panicked, Quagmire pulls out a gun, killing Homer and Marge. Their kids, Bart, Lisa, and Maggie, witness the murders, thus, they are killed as well. It has been debated whether Maggie was killed in the segment, as Maggie appears to have lots of experience with guns. \"The Juice is Loose\" He briefly appears in \"The Juice Is Loose\", and was voiced by impressionist Jeff Bergman. He was the Simpson whose presence Mayor Adam West did not want in Quahog. \"Cool Hand Peter\" In \"Cool Hand Peter\", the jury of the trial of Peter, Joe, Quagmire, and Cleveland consisted of Homer, Marge, Lisa, Bart, and Maggie Simpson, Krusty the Clown, Comic Book Guy, Groundskeeper Willie, Edna Krabappel, Ned Flanders, Otto Mann, Moe Szyslak, and", "feedback_type": "qa", "answer_start": 749, "answer_text": "Marge", "confidence": 0.9786765678832257, "answer_correct": true, "document_correct": true}
{"question": "Where does Homer work\n", "context": "I have just been appointed the new safety inspector at this very plant with a big, fat raise!” ―Homer Simpson[src] In \"Homer Scissorhands\", he worked as a hairdresser, but then he got tired of it and returned to his old job at the Springfield Nuclear Power Plant. [16] In \"Homer's Odyssey\", he worked at the Springfield Nuclear Power Plant as a technical supervisor. He was fired by Sherri and Terri's father (right in front of Bart), who was his supervisor, for creating a deadly gas leak. He was later rehired to safety inspector for Sector 7G, after complaining about the safety of the plant itself. Ironically, the accidents that occur at the plant have doubled every year since Homer was made safety inspector. [46] Homer rarely attends his job, and yet seldom gets fired (and when he does get fired, he always ends up rehired somehow) and always has his job waiting when he plans to get rehired and has impulsively quit occasionally to pursue other careers, although he always ends up losing or quitting these jobs. On one occasion, Homer Homer as Santa. has misinterpreted a threat about losing his job as a hint that he can take the following day off. Homer also applied for a job as Santa, to make up for his missed Christmas bonus at the power plant. [47] Criminal Record This article or section is incomplete. Please improve the article, or discuss the issue on the talk page. Main article: Criminal Record of Homer Simpson Homer has committed a wide range of crimes and infractions, from ticketworthy offenses to felonies.", "feedback_type": "qa", "answer_start": 231, "answer_text": "Springfield Nuclear Power Plant", "confidence": 0.7139125281256142, "answer_correct": true, "document_correct": true}
{"question": "Who are the children of Homer and Marge", "context": "Simpsons Wiki C… L… E… PAGES C… in: Female characters, Living Characters, Characters, and Marge Simpson “Hrmmm….” ―Marge's catchphrase “Now it's Marge's time to shine!” English VIEW SOURCE Marjorie Jacqueline \"Marge\" Simpson Current Witch Tennis Wizard ―Marge Simpson “Oh!” ―Marge's catchphrase “Oh, Homie!” ―Marge's love catchphrase “It's true. Women aren't very good drivers.” ―The Simpsons: Hit & Run Marjorie Jacqueline \"Marge\" Simpson (née Bouvier)[11] is the homemaker and matriarch of the Simpson family. She is also one of the five main characters in The Simpsons TV series. Marge Simpson is 36 years old. She and her husband Homer have three children: Bart, Lisa, and Maggie. Marge is the moralistic force in her family and often provides a grounding voice in the midst of her family's antics by trying to maintain order in the Simpson household. Aside from her duties at home, Marge has flirted briefly with a number of careers ranging from a police officer to an anti-violence activist. Biography Early life Marge Bouvier was born on in Capital City to Clancy Bouvier, a photographer-turnedsteward, and Jacqueline Bouvier. She is the Simpson Family (Season 22 Promo) youngest daughter of the Bouvier family. She has a pair of older sisters, the joyless twins, Patty, and Selma, both of whom passionately disapprove of Homer. Meeting Homer Marge attended Springfield High School and in her senior year, she met Homer Simpson. She was wary of Homer at first but agreed to have a study", "feedback_type": "qa", "answer_start": 661, "answer_text": "Bart, Lisa, and Maggie", "confidence": 0.9874831424126602, "answer_correct": true, "document_correct": true}
{"question": "What is Bart catchphrase?", "context": "Groening conceived Bart as an extreme version of the typical misbehaving child character, merging all of the negative traits of characters such as Tom Sawyer and Huckleberry Finn into one person. Groening's older brother Mark provided most of the inspiration for Bart. Groening has also said that he found the premise of Dennis the Menace disappointing and was inspired to create a character who was actually a menace. Voice and Catchphrases Nancy Cartwright originally auditioned for the role of Lisa, but soon thought that her voice would be better suited voicing Bart. Matt Groening let her try out for the part, and upon hearing her read, gave her the job on the spot. Bart's catchphrase \"Eat My Shorts\" was an ad-lib by Cartwright in one of the original table readings, harking back to an incident when she was at college. His other catchphrases included \"¡Ay, caramba!\" and \"Don't have a cow man!\" - the former being his first words after seeing Homer and Marge 'enjoying themselves' in bed - but these dropped out of use as the series progressed (as mentioned in \"Summer of 4 Ft. 2\", when Bart complains that Lisa stole his line). Whenever he introduces himself, he often says, \"I'm Bart Simpson. Who the hell are you?\" Reception In 1998, Time magazine selected Bart as 46th of the 100 most influential people of the 20th century — the only fictional character to make the list. He had previously appeared on the cover the December 31, 1990 edition. Both Bart and Lisa ranked #11 in TV Guide's \"Top 50 Greatest Cartoon Characters of All Time\".", "feedback_type": "qa", "answer_start": 693, "answer_text": "Eat My Shorts", "confidence": 0.8712595643772827, "answer_correct": true, "document_correct": true}
{"question": "who is the mother of the simpson\n", "context": "The magician, Diablo, finds this annoying and pulls out a ball gag and while Marge is blabbering shoves it into her mouth so her drunken talk becomes muffled sounds. This could also link to Marge's famous voice which throughout the Simpsons has been considered annoying. Marge continues to make muffled sounds from her gagged mouth while a sack is put over her head during the magic trick. Marriage After the two had been dating for several years, Marge became pregnant with Bart sometime in the summer, and Marge and Homer got married on September 29 in a small wedding chapel near the state line shortly before. Married life Marge is the mother Simpson family, who spends most of her time doing housework, caring for Maggie, being supportive of and indulging Lisa, and either disciplining or protecting Bart from Homer's wrath. Marge is the only member of the family who encourages church attendance. She also appears to have a significant athletic ability. She is bilingual, being fully fluent in French. Her marriage to Homer is also very strong. They once spurned to participate in a key party as soon as they realized what a key party was and promptly left, although Homer also took the key jar with them, most likely to find his car keys. Wild Escapades Despite these tendencies, Marge has had her fair share of wild escapades throughout the history of the series.", "feedback_type": "qa", "answer_start": 627, "answer_text": "Marge is the mother Simpson family,", "confidence": 0.9485662815376923, "answer_correct": true, "document_correct": true}
{"question": "what sport does bart like", "context": "Bart's overall intelligence, like his mother's, has been shown to fluctuate slightly over the course of the series. It has been shown anywhere from being just Bart's Catchphrase above his father's level, to being just below, or (on the rare occasion that he shows interest or is willing to pay attention) exceeding that of his sister. Despite his behavior, Bart is also extremely good at science, art and even sports like skateboarding. His actions and speech frequently show considerable mental agility, street-smarts, and understanding. When Bart became a hall monitor for Springfield Elementary, his grades went up, showing that he only struggles because he does not pay any attention. [15] Bart has ADHD. [16] This has been exaggerated to the point he is willing to do Algebra, so long as it is a distraction from his actual homework. On the other hand, Bart often seems to have trouble understanding even the simplest concepts, such as the word \"irony,\" what the equator is and that the logo on his globe (\"Rand McNally\") is not actually a country. It was also once implied that his mischievous behavior may have been a result of Marge accidentally ingesting a droplet of champagne while pregnant with him. [17] Also, as an infant, one night he wandered into the master bedroom and witnessed Homer and Marge having sex with each other. Labeled as an \"underachiever\" by authority figures, Bart rides an academic roller coaster, his grades, running the Loop-the-Loop from \"F\" to \"D-\" and back again. But he can be ingenious when the chips are down—as long as his ingenuity is not applied to anything schoolParanoid Bart related.", "feedback_type": "qa", "answer_start": 422, "answer_text": "skateboarding", "confidence": 0.9785949458826394, "answer_correct": true, "document_correct": true}
{"question": "Who are the sisters of Marge\n", "context": "They once spurned to participate in a key party as soon as they realized what a key party was and promptly left, although Homer also took the key jar with them, most likely to find his car keys. Wild Escapades Despite these tendencies, Marge has had her fair share of wild escapades throughout the history of the series. She worked as a police officer in Springfield,[12] took therapy for flight fear,[13]was a real estate agent, sold pretzels, was a painter, was imprisoned for shoplifting,[14] became a gambling addict,[15] showed alcoholic tendencies,[16]was at one time known as The Listen Lady, was an unwilling participant in a cross-country police chase,[17] overdosed on steroids,[18] cheated on a cooking competition[19] and developed amnesia. [20] Although not a chain smoker like her eldest sisters Patty and Selma, Marge has engaged in smoking twice. One of these times, however, she was implied to be an attempt to drown out the smell of the Annual Chili Cook-Off to hide it from Homer as long as possible due to realizing if he was to find out he had immediately wanted to go there, as she was motivated to go with Homer after their last visit resulted in humiliation on her part when Homer, while drunk, stripped naked and proceeded to \"bathe\" himself in a cotton candy maker under the delusion he was a puffy pink cloud. [21] Criminal record Shoplifting: In \"Marge in Chains,\" Marge steals from the Kwik-E-Mart without paying prior, prompting her imprisonment. Drug abuse: Marge overdoses on steroids in \"The Strong Arms of the Ma\".", "feedback_type": "qa", "answer_start": 810, "answer_text": "Patty and Selma", "confidence": 0.9778845351613982, "answer_correct": true, "document_correct": true}
{"question": "Who is the boss of Homer\n", "context": "Although they don't communicate well, Homer and Maggie share a special bond and he loves her deeply. Maggie's first word was \"daddy\", which he couldn't hear (due to being out of Maggie's room and shutting the door as he exited). Maggie once saved a captive Homer, who was impressed and grateful to his daughter. He has shown love for Maggie as he protected her from bullying babies in Eeny Teeny Maya, Moe and earned a hug from his daughter who punched out a baby that knocked him down. Homer later saved her from being carried off by a bald eagle and made sure to hold her close, while punching the bird so it wouldn't try to take her again. Hugo Simpson II In Treehouse of Horror VII, Hugo lives in the attic and lives off fish heads. He is said to be Bart's conjoined twin, but this is non-canon. Non-Canon Appearances The contents of this article or section are considered to be non-canon and therefore may not have actually happened/existed. This article or section is incomplete. Please improve the article, or discuss the issue on the talk page. Future At the end of \"Itchy & Scratchy: The Movie, Homer takes Bart to see The Itchy & Scratchy: The Movie. In \"Lisa's Wedding\", Homer is still working at the Springfield Nuclear Power Plant at sector 7G with Milhouse Van Houten as his supervisor. Homer, as he appears in The Simpsons Game In \"Bart to the Future\", Homer and Marge search Lincoln gold around the White House. In \"Future-Drama\", Homer's and Marge's relationship has finally ended after Homer blew the family savings on an underwater house.", "feedback_type": "qa", "answer_start": 1262, "answer_text": "Milhouse Van Houten", "confidence": 0.9801262475342174, "answer_correct": false, "document_correct": false}
{"question": "Who is the boss of Homer\n", "context": "Simpsons Wiki C… L… E… PAGES C… in: Male characters, Living Characters, Characters, and Homer Simpson English VIEW SOURCE “D'oh!” ―Homer when he makes a mistake. “Why you little...!” ―Homer strangling or trying to strangle Bart/or someone else. “Woo-hoo!” ―Homer when something good happens to him. “Mmm... (food)... *Drooling*” ―Homer's catchphrase, usually when hungry “Stupid Flanders!” ―Homer to his neighbor. “Shut up Flanders!” ―Homer also to his neighbor. “AAAAGHH!” ―Homer when hurt. “Lisa! Knock off that racket!” ―Homer when Lisa plays her saxophone. “Uh oh, the boss.” ―Homer when Mr. Burns shows up. Homer Jay Simpson Current Donut Zorro Bart “Let's all go out for frosty chocolate milkshakes!” ―Homer in the Tracey Ullman era. “Whatever, I'll be at Moe's.” ―Homer during or after his mishaps. “I am evil Ho-mer! I am evil Homer! I am evil Ho-mer!” ―Homer reveling in his mishaps. [src] “Better them than me.” ―Push notification when a character other than Homer finishes a job. [src] “Better them than me... Oh wait, that was me.” ―Push notification when Homer finishes a job. [src] “Marge, my face hurts again!” ―Homer in The Simpsons: Virtual", "feedback_type": "qa", "answer_start": 592, "answer_text": "Mr. Burns", "confidence": 0.9887606853208049, "answer_correct": true, "document_correct": true}
{"question": "Who is the boss of Homer\n", "context": "As a result of this, Homer is her legal adoptive Homer may just be a normal man, but he has had many great achievements and experiences in his life. He has won a Grammy, an Academy Award, a Pulitzer Prize, been to space and saved Springfield many times. Homer is named after Matt Groening's late father Homer Groening. In a series of interviews in 1990, Groening reportedly stated that he named the character after the Homer Simpson in The Day of the Locust, a 1939 novel by Nathanael West according to Planet Simpson, but neither explanation is considered definitive. Biography Homer Jay Simpson was born on May 12, 1956, to Abraham Simpson II and Mona Olsen. He was raised on the Simpson family farm until they were forced to move out due to Homer jumping out of a hay bale and scaring the cows into giving sour milk, causing the bank to foreclose it. At some point in his childhood, Homer began drinking alcohol like his father and accidentally caused a traffic jam in a Playskool car. According to a family tree designed by the creator of the show, Matt Groening, Mr. Burns, his boss, is a distant relative of him. His father forced him to attend Camp See-A-Tree, where he went on a date with Marge Bouvier from Camp Land-A-Man; unfortunately, he lied about his name and sustained an injury while Marge changed her appearance. Homer then accidentally stumbled into Camp Flab-Away and escaped too late to meet with her again, something that left him as heartbroken as Marge.", "feedback_type": "qa", "answer_start": 1068, "answer_text": "Mr. Burns", "confidence": 0.9887606853208049, "answer_correct": true, "document_correct": true}
{"question": "which instrument does Lisa Simpson play\n", "context": "In Japan, the broadcasters of the series found they were able to turn the apparent viewer dislike of the series around by focusing marketing attention on Lisa. Lisa's well-intended but ill-fated struggles to be a voice of reason and a force of good in her family and city struck a chord with the Japanese. Trivia In South Park, there are two character who are similar to her. Wendy Testaburger and Bebe Stevens. Wendy because she and Lisa are both well behaved and intelligent, and Bebe because they are both blonde and voices are almost similar. Lisa is the only Simpson who smokes and has a smoking problem. Lisa is the only person in her family who does not have blue in her design, which helps her stand out from them. For a long time, Lisa's saxophone solos were provided by jazz baritone saxophonist Terry Harrington. Milhouse Van Houten is Lisa's far cousin because Eliza Simpson married with Milford Van Houten. According to Milhouse, Lisa's eyes are said to be gray. However, according to Spud in \"Bart Carny\", Lisa's eyes are said to be blue. So that means that Milhouse is probably color-blind or just plain wrong. Her romantic relationship with Nelson has been mentioned or referred to throughout the series, evident in \"Lisa's Date with Density\", \"Love, Springfieldian Style\", \"Simpsons Tall Tales,\" \"Sleeping with the Enemy\", \"Wild Barts Can't Be Broken\", and \"Gorgeous Grampa\", as well as mentioned in several Future episodes. She speaks Italian, with the help of Milhouse.", "feedback_type": "qa", "answer_start": 747, "answer_text": "saxophone", "confidence": 0.9634969237363039, "answer_correct": true, "document_correct": true}
{"question": "what is the color hair of Marge\n", "context": "In fact, Kavner was acknowledged to have provided merely be a squeaky, gravelly version of her own voice when playing Time Magazine noted in 2007 how Marge's decent personality resembles that of All In The Family matriarch Edith In \"Homer's Paternity Coot\", Marge states that if she'd been born three months earlier her birthstone would be Emerald (the birthstone of May), putting her birthday in August. In \"Marge Gamer\", Marge originally said she was born on October 1, the same birthday as Randy Quaid. Although in \"Homer's Paternity Coot\", Marge stated was born sometime in February. Marge says in \"Kiss Kiss Bang Bangalore\" that her birthday is in May. However, in \"Exit Through the KwikE-Mart\", Lisa showed a calendar saying her birthday was on March 19. Including her hair, Marge is 8'6\". Without her hair, Marge would technically be about 6'4'', 6'5'' with her usual heels. [56] However, being about half a head shorter than Homer (6'0\"), her real height would be around 5'7\". Marge's hair is two feet and one inch long. Marge has hazel-colored eyes. Bouvier is the maiden name of Jacqueline Kennedy Onassis. In the episode \"Boy Meets Curl \", Marge states that she is left-handed, and that she has been using her right hand for years because she didn't want to seem unusual, and since she is able to use both her right and left hand so well, she is now ambidextrous (both left and right-handed). She is also the only known ambidextrous character. Her favorite singer is Tom Jones. Her shoe size is 13AA.", "feedback_type": "qa", "answer_start": 1039, "answer_text": "hazel-colored eyes", "confidence": 0.42277318270762787, "answer_correct": false, "document_correct": false}
{"question": "nam the dog of the simpsons", "context": "Simpsons Wiki C… L… E… PAGES C… in: Male characters, Living Characters, Incomplete, and Santa's Little Helper English VIEW SOURCE Santa's Little Helper (born May 12, age 7), also known as No. 8 (his number in the dog race in \"Simpsons Roasting on an Open Fire\"), Suds McDuff (the name he changed to after becoming Duff Beer's mascot in \"Old Yeller-Belly\"), and Santa's Stupid Name (Brian Griffin's nickname for him in \"The Simpsons Guy\"), is the Simpson family's dog. Santa's Little Helper has been with the Simpson's family the whole series instead of dying or simply not making multiple appearances like how other animals in their care have. Racing Life Oddly for a domestic dog, he has been shown to still be alive thirty years in the future, as a highly evolved canine with a large cerebellum (\"Holidays of Future Passed\") and a creature stitched together out of pieces of both he and Snowball V, in which form he is known as \"Santa's Little Hybrid\" (\"Days of Future Future\"). History Homer was relying on a Christmas bonus to buy presents, but didn't get it. He was relying on this bonus because the jar of Christmas money that Santa's Little Helper races at the Springfield Downs. Marge accumulates for the family's Christmas treats was disposed of to pay for the removal of a tattoo that Bart got on his arm. Homer took the small amount of Christmas money he made working as Santa Claus at the Springfield Mall and bet it at the dog track. He had inside information on what dog was going to win, but instead bet on the \"long shot,\" Santa's Little Helper, believing his name to be a sign.", "feedback_type": "qa", "answer_start": 130, "answer_text": "Santa's Little Helper", "confidence": 0.9550436783161269, "answer_correct": true, "document_correct": true}
{"question": "who is homer's main beer supplier", "context": "What makes this interesting is that we know Homer does consider her attractive, and he even called her beautiful in her debut episode. It's implied in \"Homerland\" that she has romantic feelings for him, but nothing came from it since it was her first and so far only appearance. Friendships Moe Szyslak “I could never stay mad at you, Moe. After all, you get me drunk.” ―Homer, on Moe[src] Moe is the owner of Moe's Tavern and is Homer's main supply of beer, making him a very important person in Homer's life. Homer spends a lot of his time talking to Moe in his tavern and seems to go to him whenever he has a problem. Homer has also helped Moe with his love life. Moe has Homer in jail told Homer before that he is his best friend and they both seem to be in understanding that the two are \"life partners.\" Despite this, Moe once risked Homer's life in exchange for a shot at being a notable name in the boxing community again, but in the end, his friendship for Homer proved stronger than his dream and he literally flew in and saved Homer from getting beaten during a match. Even so, Moe has been known to point a shotgun at Homer for various reasons (see \"Pygmoelian\" and \"The Parent Rap\"). Barney Gumble Barney Gumble is one of Homer's best friends. They were both born in 1956, making Homer the same age as Barney. They have been friends since childhood (one time getting drunk from Abe Simpson II's beer and \"wrapping Homer's wagon around a tree\") but have been best friends since high school.", "feedback_type": "qa", "answer_start": 390, "answer_text": "Moe's Tavern", "confidence": 0.985494075326376, "answer_correct": true, "document_correct": true}
{"question": "what is homer favorite snack", "context": "He also had at least two separate series of stress-induced heart attacks from learning of how much money Mr. Burns offered Lisa to repay her for her \"help\" in restoring his fortune and especially her refusal of said money: The first, upon witnessing Lisa tear up the check, was severe enough that he promptly collapsed and, according to Dr. Hibbert, underwent four simultaneous heart attacks. The second, which was after Lisa corrected him regarding just how much she actually refused, was severe enough that it caused a Code Blue alert at the Hospital. [87] Years of working in a substandard nuclear facility have left his blood irradiated to show up on an x-ray without the dye that is normally required to make the blood visible having to be administered, as well as having rendered him sterile. Homer loves food, he can almost always be seen eating far more than any one man could possibly eat alone. His favorites are foods which he knows are bad for him, and will blatantly refuse healthy food such as oatmeal and fruit in favor of fatty meals. He particularly enjoys donuts. Though he has tried multiple times to switch to a healthier diet, he has always ended up reverting to his unhealthy eating habits after a relatively short amount of time. He was once willing to die upon eating a poisoned éclair despite knowing it would kill him, only to throw it away in horror when Lisa claimed it was low fat.", "feedback_type": "qa", "answer_start": 1074, "answer_text": "donuts", "confidence": 0.9932826484879884, "answer_correct": true, "document_correct": true}
{"question": "who likes to go to Moe's Tavern", "context": "He becomes extremely attached to Stampy meets the Simpsons. animals that fall under his care and will, most of the time, save Bart in LA-Z Rider couch gag animals that he feels will be hurt or else will go to great lengths to protect them. Some of Bart's favorite pets include: his dog (and best friend) named Santa's Little Helper, a snake named Strangles, an elephant named Stampy, a racehorse named Duncan, a nest of bird-eating lizards named Chirpy Boy and Bart Junior, Santa's Little Helper's greyhound puppies and a cow named Lou, for whom he was willing to prematurely marry in order to spare from the slaughterhouse. Criminal record This article or section is incomplete. Please improve the article, or discuss the issue on the talk page. Indecent exposure: In The Simpsons Movie, Bart is dared by Homer to skateboard from home to Krusty Burger completely naked. Chief Wiggum notices this and chains Bart to a lamppost by the restaurant. Harassment over Telephone: Bart makes prank calls to Moe at his tavern as a running gag. Assault with a Deadly Weapon: In \"Please Homer, Don't Hammer 'Em\" Arson: Bart once accidentally burned down his Christmas tree when opening gifts early, and then lied about it. In addition, while he was not actually responsible for this instance, he unknowingly takes the heat for the charge of arson in order to allow Nelson Muntz, the actual culprit, to win the football championships in \"Bart Star\" (as he believed it was merely for a minor charge). Burglary: Bart technically committed this crime in order to retrieve Santa's Little Helper, although the police largely overlooked this in \"The Canine Mutiny\".", "feedback_type": "qa", "answer_start": 973, "answer_text": "Bart", "confidence": 0.8101245676595346, "answer_correct": false, "document_correct": false}
{"question": "who likes to go to Moe's Tavern", "context": "Maggie shows a stronger devotion to her mother than her father, possibly because Marge is always at home or shopping with her while Homer is mostly at work or Moe's Tavern. Once, when Homer tried to bond with her, she tried to run away. She developed a father-daughter relationship with Moe, who once saved her life. However, she does love Homer and has more than once saved his life. Not to mention she said her first word, \"Daddy\" after Homer tucked her in, although no one heard her. At the beginning Maggie seemed to rely on Marge and the likewise but eventually became fiercely independent as she was able to plan a Great Escape-style breakout from a daycare center to get all the babies' pacifiers back, which were being held under lock and key. Although treated by almost everyone as a helpless baby, she, in fact, sometimes exhibits violent mannerisms and a surprising amount of physical strength. She was able to lift up a mallet and bludgeon her father with it after being influenced by Itchy and Scratchy, as well as able to drag her father back to the shore when he got caught in a riptide. She is also surprisingly proficient with firearms and is a natural marks-woman, shown when she used a rifle to incapacitate Fat Tony and his henchmen, winging them all and driving them off when they came to kill her parents. Maggie is also slightly mischievous. When Homer was largely immobilized as a result of wearing a body cast, she spun him around like a bottle and took great joy in the endeavor.", "feedback_type": "qa", "answer_start": 0, "answer_text": "Maggie", "confidence": 0.6839796363517431, "answer_correct": false, "document_correct": false}
{"question": "what did homer shove up his nose\n", "context": "When he had shoved all of them up his Young Homer shoving crayons up his nose nasal passage he sneezed the crayons out. Not all of them, however. Unbeknownst to him, one of the crayons got lodged in the right lobe of his brain. Homer would not learn this fact until adulthood when he was forced to take a job as a human guinea pig to support his family where the crayon was found in a 3D x-ray of his brain (shortly after Dr. Hibbert admits that every time he ever viewed an x-ray of his brain he would always unknowingly block the crayon with his thumb which is why it was never found before). The doctors tell Homer that they could possibly try to remove the crayon via surgery and it would either greatly increase his intelligence or kill him. After a slight consideration, Homer chooses to take the risk. The operation ended up being a great success and with the increased blood flow in his brain, Homer's intelligence skyrocketed. His intelligence was said to jump up fifty points when he had the crayon removed, bringing him to an IQ of 105, slightly above that of an average person (though he showed far above average intelligence), but he went back to his old self when he had it reinserted, presumably lowering his IQ back down to its original 55. [64] This IQ score is, however, likely a joke or oversight on the producers' part, as someone with an IQ of 55 would be unable to look after themselves and would be classified as severely mentally handicapped.", "feedback_type": "qa", "answer_start": 58, "answer_text": "crayons", "confidence": 0.9738409381084416, "answer_correct": true, "document_correct": true}
{"question": "Where does Homer work", "context": "[61] Despite his hatred of manual labor, Homer does a surprising amount of DIY work around his home. He built a jungle gym, a costume of Florida for Lisa, a birdhouse and spice rack for Marge (however, these are shabby at best and two of them actually fell apart). He also remodeled his kitchen when Marge felt insecure about hers after meeting the neighbor's deluxe one, however, this was more because he felt emasculated when Marge tried to phone a contractor. [62] Homer's stupidity and ignorance make him clueless to sensitive matters as well as when he is being insulted or his life is in danger. An example is when he came close to drinking a beaker of sulfuric acid but was spared after his colleague, Homer asleep in Church Frank Grimes knocked the acid out of his hand. Instead of being shocked, Homer only responded with jovial delight and laughter. He was also completely oblivious to Grimes' hostility towards him, only being aware that the two of them were enemies after the latter made it painstakingly clear. Homer was an atheist and anti-gay. He adheres to no religion and only goes to church because Marge constantly forces him to. However, he was once referenced to be Muslim in \"Peeping Mom\". In \"Homer the Heretic\", he quits church altogether but later chooses to go as he was saved from an inferno, which is in his eyes a miracle. In the climax of the same episode, he is seen falling asleep during Reverend Lovejoy's sermon.", "feedback_type": "qa", "answer_start": 84, "answer_text": "around his home", "confidence": 0.6926667228631307, "answer_correct": false, "document_correct": false}
{"question": "who is the mother of the simpson", "context": "Married life Marge is the mother Simpson family, who spends most of her time doing housework, caring for Maggie, being supportive of and indulging Lisa, and either disciplining or protecting Bart from Homer's wrath. Marge is the only member of the family who encourages church attendance. She also appears to have a signi cant athletic ability. She is bilingual, being fully uent in French. Her marriage to Homer is also very strong. They once spurned to participate in a key party as soon as they realized what a key party was and promptly left, although Homer also took the key jar with them, most likely to nd his car keys. Wild Escapades Despite these tendencies, Marge has had her fair share of wild escapades throughout the history of the series. She worked as a police o cer in Spring eld,[12] took therapy for ight fear,[13]was a real estate agent, sold pretzels, was a painter, was imprisoned for shoplifting,[14] became a gambling addict,[15] showed alcoholic tendencies,[16]was at one time known as The Listen Lady, was an unwilling participant in a cross-country police chase,[17] overdosed on steroids,[18] cheated on a cooking competition[19] and developed amnesia. [20] Although not a chain smoker like her eldest sisters Patty and Selma, Marge has engaged in smoking twice.", "feedback_type": "qa", "answer_start": 13, "answer_text": "Marge", "confidence": 0.9485662815376923, "answer_correct": true, "document_correct": true}
{"question": "How long is the hair of Marge", "context": "She usually wears a long strapless pale olive green dress, red shoes, and a red pearl necklace. The necklace is a family heirloom and she is seen to have a big drawer full of them. [36] Doctor Hibbert revealed that she has webbed toes in \"Marge in Chains\". Marge remarked that she used to have a \"perfect 26-26-26\" gure. [37] Later seasons have her described/depicted as very beautiful and physically attractive, and she has been sought after by several of the men in Spring eld, most notably Moe, and even some of Bart's friends have noted her attractiveness. On special occasions, she wears a long sleeved dress with white pearls that are very similar to Lisa's. As a teen, Marge had waist-length hair that she always wore down, but wore it in her trademark beehive for senior prom. [38] In ashbacks showing Marge as a child, she is portrayed with her hair worn tall, which could mean she straightened it when she got older. Her hair is thick enough for her to keep objects like the family savings in it. [39] The original design of Marge Her hair is once shown close to her knees, consistent with the logic that a lot of hair would be needed to create her tall beehive. [40] It was revealed by Homer that Marge dyes her hair with blue dye #56, stating \"She’s been gray as a mule since she was seventeen.\"", "feedback_type": "qa", "answer_start": 686, "answer_text": "waist-length", "confidence": 0.9279426157967592, "answer_correct": true, "document_correct": true}
{"question": "How long is the hair of Marge", "context": "[56] However, being about half a head shorter than Homer (6'0\"), her real height would be around 5'7\". Marge's hair is two feet and one inch long. Marge has hazel-colored eyes. Bouvier is the maiden name of Jacqueline Kennedy Onassis. In the episode \"Boy Meets Curl \", Marge states that she is left-handed, and that she has been using her right hand for years because she didn't want to seem unusual, and since she is able to use both her right and left hand so well, she is now ambidextrous (both left and right-handed). She is also the only known ambidextrous character. Her favorite singer is Tom Jones. Her shoe size is 13AA. Marge's worst fear is never being a grandmother, but Homer believes it to be Lisa getting a beard of bees. As shown in \"Kill Gil: Vols. 1 & 2\", Marge has trouble saying \"no\". As shown when she was about 7, Patty and Selma told Marge to hide their cigarettes in her dollhouse. She refused and got stu ed into the dollhouse. She can speak uent French Marge also needs to wear glasses, but doesn't want to wear them as she thinks they make her look dowdy. [57] Marge's middle name is Jacqueline, another nod to Jackie Kennedy Onassis. Marge's number one concern is being hit in the eye with the rubber band around her morning newspaper when she takes it o . Marge wearing her glasses. In \"Scenes from the Class Struggle in Spring eld\", it is mentioned that her hair is around eighteen inches long.", "feedback_type": "qa", "answer_start": 119, "answer_text": "two feet and one inch long", "confidence": 0.9279426157967592, "answer_correct": true, "document_correct": true}
{"question": "with whom does homer go to Moe's Tavern", "context": "She confesses to Homer that she is his to do with as he wants, becoming his personal assistant and attempting to seduce him at every turn. When he proclaims that his heart belongs to Marge she attempts to kill him with no success. [80] Wasted potential love interests Annie Crawford Annie was a FBI agent who was investigating Homer after Lisa said he could be a terrorist. What makes this interesting is that we know Homer does consider her attractive, and he even called her beautiful in her debut episode. It's implied in \"Homerland\" that she has romantic feelings for him, but nothing came from it since it was her rst and so far only appearance. Friendships Moe Szyslak “I could never stay mad at you, Moe. After all, you get me drunk.” ―Homer, on Moe[src] Moe is the owner of Moe's Tavern and is Homer's main supply of beer, making him a very important person in Homer's life. Homer spends a lot of his time talking to Moe in his tavern and seems to go to him whenever he has a problem. Homer has also helped Moe with his love life. Moe has Homer in jail told Homer before that he is his best friend and they both seem to be in understanding that the two are \"life partners.\" Despite this, Moe once risked Homer's life in exchange for a shot at being a notable name in the boxing community again, but in the end, his friendship for Homer proved stronger than his dream and he literally ew in and saved Homer from getting beaten during a match.", "feedback_type": "qa", "answer_start": 663, "answer_text": "Moe Szyslak", "confidence": 0.886281744636229, "answer_correct": false, "document_correct": false}
{"question": "Homer hang out with whom all the time in Moe's Tavern?", "context": "Homer Jay Simpson (born May 12, 1955, or 1969 or 1976 or 1983)[36] is the main protagonist of The Simpsons series (or show). He is the spouse of Marge Simpson and father of Bart, Lisa and Maggie Simpson. Homer is overweight (said to be ~240 pounds), lazy, and often ignorant to the world around him. Although Homer has many aws, he has shown to have great caring, love, and even bravery to those he cares about and, sometimes, even others he doesn't. He also serves as the main protagonist of the The Simpsons Movie. Homer Simpson is 39 years old. His favorite color is blue, and he enjoys dancing, eating donuts, drinking, hugging, driving a sit-down arcade racer, playing the piano and horse riding. His favorite kiddie rides are \"Stuart Little\", \"Barney Train\" and \"Ride the Champion Mechanical Horse\". Homer works as a low-level safety inspector at the Spring eld Nuclear Power Plant in Sector 7G, although he is often incompetent and negligent towards his duties. He spends a great deal of his time at Moe's Tavern with his friends Barney Gumble, Carl Carlson, Lenny Leonard, and Moe Szyslak. At home, he can often be found sitting on the couch mindlessly watching TV while snacking on food and drinking Du . Homer is also the only son of Abraham Simpson II and Mona Simpson. When provoked, he often strangles Bart for pressuring him.", "feedback_type": "qa", "answer_start": 1037, "answer_text": "Barney Gumble, Carl Carlson, Lenny Leonard, and Moe Szyslak", "confidence": 0.933691538079049, "answer_correct": true, "document_correct": true}
